Repository: bminor/bash
Catalog: po/*.po
Languages: pl

source: syntax error in conditional expression: unexpected token `%s'
pl: b³±d sk³adni w wyra¿eniu warunkowym: nieoczekiwany znacznik `%s'

source: syntax error in conditional expression
pl: b³±d sk³adni w wyra¿eniu warunkowym

source: unexpected token `%s', expected `)'
pl: nieoczekiwany znacznik `%s', oczekiwano `)'

source: expected `)'
pl: oczekiwano `)'

source: unexpected argument `%s' to conditional unary operator
pl: nieoczekiwany argument `%s' jednoargumentowego operatora warunkowego

source: unexpected argument to conditional unary operator
pl: nieoczekiwany argument jednoargumentowego operatora warunkowego

source: unexpected token `%s', conditional binary operator expected
pl: nieoczekiwany argument `%s', oczekiwano dwuarg. operatora warunkowego

source: conditional binary operator expected
pl: oczekiwano dwuargumentowego operatora warunkowego

source: unexpected argument `%s' to conditional binary operator
pl: nieoczekiwany argument `%s' dwuargumentowego operatora warunkowego

source: unexpected argument to conditional binary operator
pl: nieoczekiwany argument dwuargumentowego operatora warunkowego

source: unexpected token `%c' in conditional command
pl: nieoczekiwany znacznik `%c' w poleceniu warunkowym

source: unexpected token `%s' in conditional command
pl: nieoczekiwany znacznik `%s' w poleceniu warunkowym

source: unexpected token %d in conditional command
pl: nieoczekiwany znacznik %d w poleceniu warunkowym

source: syntax error near unexpected token `%s'
pl: b³±d sk³adni przy nieoczekiwanym znaczniku `%s'

source: syntax error near `%s'
pl: b³±d sk³adni przy `%s'

source: syntax error: unexpected end of file
pl: b³±d sk³adni: nieoczekiwany koniec pliku

source: syntax error
pl: b³±d sk³adni

source: Use "%s" to leave the shell.
pl: U¿yj "%s", aby opu¶ciæ tê pow³okê.

source: unexpected EOF while looking for matching `)'
pl: nieoczekiwany EOF podczas poszukiwania pasuj±cego `)'

source: completion: function `%s' not found
pl: uzupe³nienie: nie znaleziono funkcji `%s'

source: print_command: bad connector `%d'
pl: print_command: z³y ³±cznik `%d'

source: xtrace_set: %d: invalid file descriptor
pl: xtrace_set: %d: nieprawid³owy deskryptor pliku

source: xtrace_set: NULL file pointer
pl: xtrace_set: pusty wska¼nik pliku

source: cprintf: `%c': invalid format character
pl: cprintf: `%c': nieprawid³owy znak formatuj±cy

source: file descriptor out of range
pl: deskryptor pliku poza zakresem

source: %s: ambiguous redirect
pl: %s: niejednoznaczne przekierowanie

source: %s: cannot overwrite existing file
pl: %s: nie mo¿na nadpisaæ istniej±cego pliku

source: %s: restricted: cannot redirect output
pl: %s: ograniczony: nie mo¿na przekierowaæ wyj¶cia

source: cannot create temp file for here-document: %s
pl: nie mo¿na utworzyæ pliku tymczasowego dla dokumentu miejscowego: %s

source: %s: cannot assign fd to variable
pl: %s: nie mo¿na przypisaæ deskryptora pliku do zmiennej

source: /dev/(tcp|udp)/host/port not supported without networking
pl: /dev/(tcp|udp)/host/port nie s± wspierane bez sieci

source: redirection error: cannot duplicate fd
pl: b³±d przekierowania: nie mo¿na powieliæ deskryptora pliku

source: could not find /tmp, please create!
pl: nie mo¿na znale¼æ /tmp, proszê o utworzenie!

source: /tmp must be a valid directory name
pl: /tmp musi byæ prawid³ow± nazw± katalogu

source: %c%c: invalid option
pl: %c%c: nieprawid³owa opcja

source: I have no name!
pl: Nie mam nazwy!

source: GNU bash, version %s-(%s)
pl: GNU bash, wersja %s-(%s)

source: Usage: %s [GNU long option] [option] ... %s [GNU long option] [option] script-file ...
pl: U¿ycie: %s [d³uga opcja GNU] [opcja] ... %s [d³uga opcja GNU] [opcja] plik-skryptu ...

source: GNU long options:
pl: D³ugie opcje GNU:

source: Shell options:
pl: Opcje pow³oki:

source: -%s or -o option
pl: -%s lub -o opcja

source: Type `%s -c "help set"' for more information about shell options.
pl: Aby uzyskaæ wiêcej informacji o opcjach pow³oki, napisz `%s -c "help set"'.

source: Type `%s -c help' for more information about shell builtin commands.
pl: Aby uzyskaæ wiêcej informacji o poleceniach wewnêtrznych pow³oki, napisz `%s -c help'.

source: Use the `bashbug' command to report bugs.
pl: Do zg³aszania b³êdów nale¿y u¿ywaæ polecenia `bashbug'.

source: sigprocmask: %d: invalid operation
pl: sigprocmask: %d: nieprawid³owa operacja

source: Bogus signal
pl: B³êdny sygna³

source: Hangup
pl: Roz³±czenie

source: Interrupt
pl: Przerwanie

source: Quit
pl: Wyj¶cie

source: Illegal instruction
pl: Niedozwolona instrukcja

source: BPT trace/trap
pl: Pu³apka debuggera/breakpoint

source: ABORT instruction
pl: Instrukcja ABORT

source: EMT instruction
pl: Pu³apka EMT

source: Floating point exception
pl: B³±d w obliczeniach zmiennoprzecinkowych

source: Killed
pl: Unicestwiony

source: Bus error
pl: B³±d szyny

source: Segmentation fault
pl: Naruszenie ochrony pamiêci

source: Bad system call
pl: B³êdne wywo³anie systemowe

source: Broken pipe
pl: Przerwany potok

source: Alarm clock
pl: Budzik

source: Terminated
pl: Zakoñczony

source: Urgent IO condition
pl: Nag³e ¿±danie we/wy

source: Stopped (signal)
pl: Zatrzymany (sygna³)

source: Continue
pl: Kontynuacja

source: Child death or stop
pl: ¦mieræ lub zatrzymanie potomka

source: Stopped (tty input)
pl: Zatrzymany (wej¶cie z tty)

source: Stopped (tty output)
pl: Zatrzymany (wyj¶cie na tty)

source: I/O ready
pl: We/wy gotowe

source: CPU limit
pl: Przekroczony limit procesora

source: File limit
pl: Przekroczony limit pliku

source: Alarm (virtual)
pl: Alarm (wirtualny)

source: Alarm (profile)
pl: Alarm (profiler)

source: Window changed
pl: Okno zmienione

source: Record lock
pl: Zasoby utracone

source: User signal 1
pl: Sygna³ u¿ytkownika 1

source: User signal 2
pl: Sygna³ u¿ytkownika 2

source: HFT input data pending
pl: Dane wej¶ciowe HFT

source: power failure imminent
pl: Bliska awaria zasilania

source: system crash imminent
pl: Bliska awaria systemu

source: migrate process to another CPU
pl: Przeniesienie procesu na inny procesor

source: programming error
pl: B³±d programowania

source: HFT monitor mode granted
pl: Nadany tryb monitora HFT

source: HFT monitor mode retracted
pl: Wycofany tryb monitora HFT

source: HFT sound sequence has completed
pl: Sekwencja d¼wiêkowa HFT zakoñczona

source: Information request
pl: ¯±danie informacji

source: Unknown Signal #
pl: Nieznany sygna³ #

source: Unknown Signal #%d
pl: Nieznany sygna³ #%d

source: bad substitution: no closing `%s' in %s
pl: z³e podstawienie: brak zamykaj±cego `%s' w %s

source: %s: cannot assign list to array member
pl: %s: nie mo¿na przypisaæ listy do elementu tablicy

source: cannot make pipe for process substitution
pl: nie mo¿na utworzyæ potoku dla podstawienia procesu

source: cannot make child for process substitution
pl: nie mo¿na utworzyæ procesu potomnego dla podstawienia procesu

source: cannot open named pipe %s for reading
pl: nie mo¿na otworzyæ nazwanego potoku %s do odczytu

source: cannot open named pipe %s for writing
pl: nie mo¿na otworzyæ nazwanego potoku %s do zapisu

source: cannot duplicate named pipe %s as fd %d
pl: nie mo¿na powieliæ nazwanego potoku %s jako deskryptor %d

source: cannot make pipe for command substitution
pl: nie mo¿na utworzyæ potoku dla podstawienia polecenia

source: cannot make child for command substitution
pl: nie mo¿na utworzyæ procesu potomnego dla podstawienia polecenia

source: command_substitute: cannot duplicate pipe as fd 1
pl: command_substitute: nie mo¿na powieliæ potoku jako deskryptora 1

source: %s: parameter null or not set
pl: %s: parametr pusty lub nieustawiony

source: %s: substring expression < 0
pl: %s: wyra¿enie dla pod³añcucha < 0

source: %s: bad substitution
pl: %s: z³e podstawienie

source: $%s: cannot assign in this way
pl: $%s: nie mo¿na przypisywaæ w ten sposób

source: future versions of the shell will force evaluation as an arithmetic substitution
pl: przysz³e wersje pow³oki bêd± wymuszaæ obliczenie jako podstawienie arytmetyczne

source: bad substitution: no closing "`" in %s
pl: z³e podstawienie: brak zamykaj±cego "`" w %s

source: no match: %s
pl: brak pasuj±cego: %s

source: argument expected
pl: oczekiwano argumentu

source: %s: integer expression expected
pl: %s: oczekiwano wyra¿enia ca³kowitego

source: `)' expected
pl: oczekiwano `)'

source: `)' expected, found %s
pl: oczekiwano `)', znaleziono %s

source: %s: unary operator expected
pl: %s: oczekiwano operatora jednoargumentowego

source: %s: binary operator expected
pl: %s: oczekiwano operatora dwuargumentowego

source: missing `]'
pl: brakuj±cy `]'

source: invalid signal number
pl: nieprawid³owy numer sygna³u

source: run_pending_traps: bad value in trap_list[%d]: %p
pl: run_pending_traps: z³a warto¶æ trap_list[%d]: %p

source: run_pending_traps: signal handler is SIG_DFL, resending %d (%s) to myself
pl: run_pending_traps: obs³uga sygna³u jest ustawiona na SIG_DFL, wysy³aj±c %d (%s) do siebie

source: trap_handler: bad signal %d
pl: trap_handler: z³y sygna³ %d

source: error importing function definition for `%s'
pl: b³±d importu definicji funkcji dla `%s'

source: shell level (%d) too high, resetting to 1
pl: poziom pow³oki (%d) jest za du¿y, ustawiono na 1

source: make_local_variable: no function context at current scope
pl: make_local_variable: brak kontekstu funkcji w bie¿±cym zakresie

source: all_local_variables: no function context at current scope
pl: all_local_variables: brak kontekstu funkcji w bie¿±cym zakresie

source: %s has null exportstr
pl: %s ma pusty exportstr

source: invalid character %d in exportstr for %s
pl: nieprawid³owy znak %d w exportstr dla %s

source: no `=' in exportstr for %s
pl: brak `=' w exportstr dla %s

source: pop_var_context: head of shell_variables not a function context
pl: pop_var_context: nag³ówek shell_variables poza kontekstem funkcji

source: pop_var_context: no global_variables context
pl: pop_var_context: brak kontekstu global_variables

source: pop_scope: head of shell_variables not a temporary environment scope
pl: pop_scope: nag³ówek shell_variables poza zakresem tymczasowego ¶rodowiska

source: %s: %s: cannot open as FILE
pl: %s: %s: nie mo¿na otworzyæ jako PLIK

source: %s: %s: invalid value for trace file descriptor
pl: %s: %s: nieprawid³owa warto¶æ dla deskryptora pliku do ¶ledzenia

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
pl: Licencja GPLv3+: GNU GPL wersja 3 lub pó¼niejsza <http://gnu.org/licenses/gpl.html>

source: GNU bash, version %s (%s)
pl: GNU bash, wersja %s (%s)

source: %s: cannot allocate %lu bytes (%lu bytes allocated)
pl: %s: nie mo¿na przydzieliæ %lu bajtów (przydzielono %lu)

source: %s: cannot allocate %lu bytes
pl: %s: nie mo¿na przydzieliæ %lu bajtów

source: %s: %s:%d: cannot allocate %lu bytes (%lu bytes allocated)
pl: %s: %s:%d: nie mo¿na przydzieliæ %lu bajtów (przydzielono %lu)

source: %s: %s:%d: cannot allocate %lu bytes
pl: %s: %s:%d: nie mo¿na przydzieliæ %lu bajtów

source: alias [-p] [name[=value] ... ]
pl: alias [-p] [nazwa[=warto¶æ] ... ]

source: unalias [-a] name [name ...]
pl: unalias [-a] nazwa [nazwa ...]

source: builtin [shell-builtin [arg ...]]
pl: builtin [polecenie-wbudowane [arg ... ]]

source: caller [expr]
pl: caller [wyra¿enie]

source: cd [-L|[-P [-e]]] [dir]
pl: cd [-L|[-P [-e]]] [katalog]

source: command [-pVv] command [arg ...]
pl: command [-pVv] polecenie [arg ...]

source: typeset [-aAfFgilrtux] [-p] name[=value] ...
pl: typeset [-aAfFgilrtux] [-p] nazwa[=warto¶æ] ...

source: local [option] name[=value] ...
pl: local [opcja] nazwa[=warto¶æ] ...

source: enable [-a] [-dnps] [-f filename] [name ...]
pl: enable [-a] [-dnps] [-f plik] [nazwa ...]

source: getopts optstring name [arg]
pl: getopts ³añcuch-opcji nazwa [arg]

source: exec [-cl] [-a name] [command [arguments ...]] [redirection ...]
pl: exec [-cl] [-a nazwa] [polecenie [argumenty ...]] [przekierowanie ...]

source: fc [-e ename] [-lnr] [first] [last] or fc -s [pat=rep] [command]
pl: fc [-e nazwa-ed] [-lnr] [pierwszy] [ostatni] lub fc -s [wz=zam] [polecenie]

source: fg [job_spec]
pl: fg [zadanie]

source: bg [job_spec ...]
pl: bg [zadanie ...]

source: hash [-lr] [-p pathname] [-dt] [name ...]
pl: hash [-lr] [-p ¶cie¿ka] [-dt] [nazwa ...]

source: help [-dms] [pattern ...]
pl: help [-dms] [wzorzec ...]

source: history [-c] [-d offset] [n] or history -anrw [filename] or history -ps arg [arg...]
pl: history [-c] [-d offset] [n] lub history -anrw [plik] lub history -ps arg [arg ...]

source: jobs [-lnprs] [jobspec ...] or jobs -x command [args]
pl: jobs [-lnprs] [zadanie ...] lub jobs -x polecenie [argumenty]

source: disown [-h] [-ar] [jobspec ...]
pl: disown [-h] [-ar] [zadanie ...]

source: kill [-s sigspec | -n signum | -sigspec] pid | jobspec ... or kill -l [sigspec]
pl: kill [-s sygna³ | -n numer-sygna³u | -sygna³] pid | zadanie ... lub kill -l [sygna³]

source: read [-ers] [-a array] [-d delim] [-i text] [-n nchars] [-N nchars] [-p prompt] [-t timeout] [-u fd] [name ...]
pl: read [-ers] [-a tablica] [-d separator] [-i tekst] [-n liczba] [-N liczba] [-p zachêta] [-t czas] [-u fd] [nazwa ...]

source: set [-abefhkmnptuvxBCHP] [-o option-name] [--] [arg ...]
pl: set [-abefhkmnptuvxBCHP] [-o nazwa-opcji] [--] [arg ...]

source: export [-fn] [name[=value] ...] or export -p
pl: export [-fn] [nazwa[=warto¶æ] ...] lub export -p

source: readonly [-aAf] [name[=value] ...] or readonly -p
pl: readonly [aAf] [nazwa[=warto¶æ] ...] lub readonly -p

source: source filename [arguments]
pl: source plik [argumenty]

source: . filename [arguments]
pl: . plik [argumenty]

source: test [expr]
pl: test [wyra¿enie]

source: trap [-lp] [[arg] signal_spec ...]
pl: trap [-lp] [[arg] sygna³ ...]

source: type [-afptP] name [name ...]
pl: type [-afptP] nazwa [nazwa ...]

source: umask [-p] [-S] [mode]
pl: umask [-p] [-S] [uprawnienia]

source: for NAME [in WORDS ... ] ; do COMMANDS; done
pl: for NAZWA [in S£OWA ... ] ; do POLECENIA; done

source: for (( exp1; exp2; exp3 )); do COMMANDS; done
pl: for (( wyr1; wyr2; wyr3 )); do POLECENIA; done

source: select NAME [in WORDS ... ;] do COMMANDS; done
pl: select NAZWA [in S£OWA ... ;] do POLECENIA; done

source: time [-p] pipeline
pl: time [-p] potok

source: case WORD in [PATTERN [| PATTERN]...) COMMANDS ;;]... esac
pl: case S£OWO in [WZORZEC [| WZORZEC]...) POLECENIA ;;]... esac

source: if COMMANDS; then COMMANDS; [ elif COMMANDS; then COMMANDS; ]... [ else COMMANDS; ] fi
pl: if POLECENIA; then POLECENIA; [ elif POLECENIA; then POLECENIA; ]... [ else POLECENIA; ] fi

source: while COMMANDS; do COMMANDS; done
pl: while POLECENIA; do POLECENIA; done

source: until COMMANDS; do COMMANDS; done
pl: until POLECENIA; do POLECENIA; done

source: coproc [NAME] command [redirections]
pl: coproc [NAZWA] polecenie [przekierowania]

source: function name { COMMANDS ; } or name () { COMMANDS ; }
pl: function nazwa { POLECENIA ; } lub nazwa () { POLECENIA ; }

source: { COMMANDS ; }
pl: { POLECENIA ; }

source: job_spec [&]
pl: zadanie [&]

source: (( expression ))
pl: (( wyra¿enie ))

source: [[ expression ]]
pl: [[ wyra¿enie ]]

source: variables - Names and meanings of some shell variables
pl: zmienne - nazwy i znaczenie niektórych zmiennych pow³oki

source: pushd [-n] [+N | -N | dir]
pl: pushd [-n] [+N | -N | katalog]

source: shopt [-pqsu] [-o] [optname ...]
pl: shopt [-pqsu] [-o] [nazwa-opcji ...]

source: printf [-v var] format [arguments]
pl: printf [-v var] format [argumenty]

source: complete [-abcdefgjksuv] [-pr] [-DE] [-o option] [-A action] [-G globpat] [-W wordlist] [-F function] [-C command] [-X filterpat] [-P prefix] [-S suffix] [name ...]
pl: complete [-abcdefgjksuv] [-pr] [-DE] [-o opcja] [-A akcja] [-G wzorzec-glob] [-W lista-s³ów] [-F funkcja] [-C polecenie] [-X wzorzec-filtra] [-P przedrostek] [-S przyrostek] [nazwa ...]

source: compgen [-abcdefgjksuv] [-o option] [-A action] [-G globpat] [-W wordlist] [-F function] [-C command] [-X filterpat] [-P prefix] [-S suffix] [word]
pl: compgen [-abcdefgjksuv] [-o opcja] [-A akcja] [-G wzorzec-glob] [-W lista-s³ów] [-F funkcja] [-C polecenie] [-X wzorzec-filtra] [-P przedrostek ] [-S przyrostek] [s³owo]

source: compopt [-o|+o option] [-DE] [name ...]
pl: compopt [-o|+o opcja] [-DE] [nazwa ...]

source: mapfile [-n count] [-O origin] [-s count] [-t] [-u fd] [-C callback] [-c quantum] [array]
pl: mapfile [-n liczba] [-O pocz±tek] [-s liczba] [-t] [-u fd] [-C wywo³anie] [-c co-ile] [tablica]

source: readarray [-n count] [-O origin] [-s count] [-t] [-u fd] [-C callback] [-c quantum] [array]
pl: readarray [-n liczba] [-O pocz±tek] [-s liczba] [-t] [-u fd] [-C wywo³anie] [-c co-ile] [tablica]

source: Define or display aliases. Without arguments, `alias' prints the list of aliases in the reusable form `alias NAME=VALUE' on standard output. Otherwise, an alias is defined for each NAME whose VALUE is given. A trailing space in VALUE causes the next word to be checked for alias substitution when the alias is expanded. Options: -p Print all defined aliases in a reusable format Exit Status: alias returns true unless a NAME is supplied for which no alias has been defined.
pl: Definiowanie i wy¶wietlanie aliasów. Bez argumentów `alias' wypisuje na standardowym wyj¶ciu listê aliasów w postaci alias NAZWA=WARTO¦Æ. W przeciwnym przypadku definiowany jest alias dla ka¿dej NAZWY, dla której podano WARTO¦Æ. Spacja na koñcu WARTO¦CI powoduje, ¿e podczas rozwijania tego aliasu podstawienie aliasów bêdzie przeprowadzone tak¿e dla nastêpnego s³owa. Opcje: -p Wypisanie wszystkich zdefiniowanych aliasów w formacie do ponownego u¿ycia Stan wyj¶ciowy: Polecenie alias zwraca prawdê, chyba ¿e poda siê NAZWÊ, dla której nie zdefiniowano aliasu.

source: Remove each NAME from the list of defined aliases. Options: -a remove all alias definitions. Return success unless a NAME is not an existing alias.
pl: Usuwa wszystkich NAZW z listy zdefiniowanych aliasów. Opcje: -a usuniêcie wszystkich definicji aliasów. Zwracana jest prawda, chyba ¿e NAZWA nie jest istniej±cym aliasem.

source: Exit for, while, or until loops. Exit a FOR, WHILE or UNTIL loop. If N is specified, break N enclosing loops. Exit Status: The exit status is 0 unless N is not greater than or equal to 1.
pl: Wyj¶cie z pêtli for, while lub until. Wyj¶cie z pêtli FOR, WHILE lub UNTIL. Je¶li podano N, sterowanie wychodzi za N-t± zagnie¿d¿on± pêtlê. Stan wyj¶ciowy: Instrukcja zwraca prawdê, chyba ¿e N jest mniejsze ni¿ 1.

source: Resume for, while, or until loops. Resumes the next iteration of the enclosing FOR, WHILE or UNTIL loop. If N is specified, resumes the Nth enclosing loop. Exit Status: The exit status is 0 unless N is not greater than or equal to 1.
pl: Wznowienie pêtli for, while lub until. Wznowienie nastêpnej iteracji otaczaj±cej pêtli FOR, WHILE lub UNTIL. Je¶li podano N, to wznawiana jest N-ta otaczaj±ca pêtla. Stan wyj¶ciowy: Instrukcja zwraca 0, chyba ¿e N jest mniejsze ni¿ 1.

source: Execute shell builtins. Execute SHELL-BUILTIN with arguments ARGs without performing command lookup. This is useful when you wish to reimplement a shell builtin as a shell function, but need to execute the builtin within the function. Exit Status: Returns the exit status of SHELL-BUILTIN, or false if SHELL-BUILTIN is not a shell builtin..
pl: Wywo³anie polecenia wbudowanego pow³oki. Wywo³anie POLECENIA-WBUDOWANEGO z argumentami ARG bez wykonywania wyszukiwania polecenia. Jest to przydatne w przypadku ponownego implementowania polecenia wbudowanego jako funkcji pow³oki i wywo³ywania polecenia wbudowanego z wewn±trz tej funkcji. Stan wyj¶ciowy: Instrukcja zwraca stan wyj¶ciowy POLECENIA-WBUDOWANEGO lub fa³sz, je¶li POLECENIE-WBUDOWANE nie jest poleceniem wbudowanym pow³oki.

source: Return the context of the current subroutine call. Without EXPR, returns "$line $filename". With EXPR, returns "$line $subroutine $filename"; this extra information can be used to provide a stack trace. The value of EXPR indicates how many call frames to go back before the current one; the top frame is frame 0. Exit Status: Returns 0 unless the shell is not executing a shell function or EXPR is invalid.
pl: Zwrócenie kontekstu wywo³ania bie¿±cej procedury. Bez WYRA¯ENIA zwracane jest "$linia $plik". Z WYRA¯ENIEM zwracane jest "$linia $procedura $plik"; dodatkowe informacje s³u¿± do udostêpnienia ¶ladu stosu. Warto¶æ WYRA¯ENIA okre¶la o ile ramek wywo³añ wzglêdem bie¿±cej ramki nale¿y siê cofn±æ; numer najwy¿szej ramki to 0. Stan wyj¶ciowy: Polecenie zwraca 0, chyba ¿e pow³oka nie wykonuje funkcji lub WYRA¯ENIE jest nieprawid³owe.

source: Print the name of the current working directory. Options: -L print the value of $PWD if it names the current working directory -P print the physical directory, without any symbolic links By default, `pwd' behaves as if `-L' were specified. Exit Status: Returns 0 unless an invalid option is given or the current directory cannot be read.
pl: Wypisanie nazwy bie¿±cego katalogu roboczego. Opcje: -L wypisanie warto¶ci $PWD je¶li okre¶la bie¿±cy katalog roboczy -P wypisanie katalogu fizycznego, bez dowi±zañ symbolicznych Domy¶lnie `pwd' zachowuje siê tak, jak z opcj± `-L'. Stan wyj¶ciowy: Polecenie zwraca 0, chyba ¿e podano nieprawid³ow± opcjê lub katalog bie¿±cy nie mo¿e byæ odczytany.

source: Null command. No effect; the command does nothing. Exit Status: Always succeeds.
pl: Polecenie puste. ¯adnego efektu; polecenie nic nie robi. Stan wyj¶ciowy: Zawsze zwracana jest prawda.

source: Return a successful result. Exit Status: Always succeeds.
pl: Zwrócenie wyniku pozytywnego. Stan wyj¶ciowy: Zawsze zwracana jest prawda.

source: Return an unsuccessful result. Exit Status: Always fails.
pl: Zwrócenie wyniku negatywnego. Stan wyj¶ciowy: Zawsze zwracany jest fa³sz.

source: Execute a simple command or display information about commands. Runs COMMAND with ARGS suppressing shell function lookup, or display information about the specified COMMANDs. Can be used to invoke commands on disk when a function with the same name exists. Options: -p use a default value for PATH that is guaranteed to find all of the standard utilities -v print a description of COMMAND similar to the `type' builtin -V print a more verbose description of each COMMAND Exit Status: Returns exit status of COMMAND, or failure if COMMAND is not found.
pl: Wywo³anie prostego polecenia lub wy¶wietlenie informacji o poleceniach. Uruchomienie POLECENIA z ARGUMENTAMI z pominiêciem wyszukiwania funkcji pow³oki lub wy¶wietlenie informacji o podanych POLECENIACH. Mo¿e byæ u¿yte do wywo³ania poleceñ z dysku je¶li ju¿ istnieje funkcja o danej nazwie. Opcje: -p u¿ycie domy¶lnej warto¶ci PATH, pod któr± powinny byæ wszystkie standardowe narzêdzia -v wypisanie opisu POLECENIA w sposób podobny do polecenia `type' -V wypisanie szczegó³owego opisu ka¿dego POLECENIA Stan wyj¶ciowy: Polecenie zwraca stan POLECENIA lub fa³sz, je¶li POLECENIE nie zosta³o znalezione.

source: Set variable values and attributes. Obsolete. See `help declare'.
pl: Ustawienie warto¶ci i atrybutów zmiennej. Polecenie przestarza³e - p. `help declare'.

source: Write arguments to the standard output. Display the ARGs on the standard output followed by a newline. Options: -n do not append a newline Exit Status: Returns success unless a write error occurs.
pl: Wypisanie argumentów na standardowym wyj¶ciu. Wypisanie na standardowym wyj¶ciu argumentów ARG i znaku koñca linii. Opcje: -n niedo³±czanie znaku koñca linii Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e wyst±pi b³±d zapisu.
