Repository: bminor/bash
Catalog: po/*.po
Languages: pl

source: Common shell variable names and usage. BASH_VERSION Version information for this Bash. CDPATH A colon-separated list of directories to search for directories given as arguments to `cd'. GLOBIGNORE A colon-separated list of patterns describing filenames to be ignored by pathname expansion. HISTFILE The name of the file where your command history is stored. HISTFILESIZE The maximum number of lines this file can contain. HISTSIZE The maximum number of history lines that a running shell can access. HOME The complete pathname to your login directory. HOSTNAME The name of the current host. HOSTTYPE The type of CPU this version of Bash is running under. IGNOREEOF Controls the action of the shell on receipt of an EOF character as the sole input. If set, then the value of it is the number of EOF characters that can be seen in a row on an empty line before the shell will exit (default 10). When unset, EOF signifies the end of input. MACHTYPE A string describing the current system Bash is running on. MAILCHECK How often, in seconds, Bash checks for new mail. MAILPATH A colon-separated list of filenames which Bash checks for new mail. OSTYPE The version of Unix this version of Bash is running on. PATH A colon-separated list of directories to search when looking for commands. PROMPT_COMMAND A command to be executed before the printing of each primary prompt. PS1 The primary prompt string. PS2 The secondary prompt string. PWD The full pathname of the current directory. SHELLOPTS A colon-separated list of enabled shell options. TERM The name of the current terminal type. TIMEFORMAT The output format for timing statistics displayed by the `time' reserved word. auto_resume Non-null means a command word appearing on a line by itself is first looked for in the list of currently stopped jobs. If found there, that job is foregrounded. A value of `exact' means that the command word must exactly match a command in the list of stopped jobs. A value of `substring' means that the command word must match a substring of the job. Any other value means that the command must be a prefix of a stopped job. histchars Characters controlling history expansion and quick substitution. The first character is the history substitution character, usually `!'. The second is the `quick substitution' character, usually `^'. The third is the `history comment' character, usually `#'. HISTIGNORE A colon-separated list of patterns used to decide which commands should be saved on the history list.
pl: Popularne zmienne pow³oki i ich zastosowanie. BASH_VERSION Informacja o wersji tego Basha. CDPATH Rozdzielona dwukropkami lista katalogów do wyszukiwania katalogów podanych jako argumenty `cd'. GLOBIGNORE Rozdzielona dwukropkami lista wzorców nazw plików do ignorowania przy rozwijaniu ¶cie¿ek. HISTFILE Nazwa pliku, w którym zapisywana jest historia poleceñ. HISTFILESIZE Maksymalna liczba linii w tym pliku. HISTSIZE Maksymalna liczba linii historii, do której ma dostêp dzia³aj±ca pow³oka. HOME Pe³na ¶cie¿ka do katalogu logowania. HOSTNAME Nazwa bie¿±cego hosta. HOSTTYPE Rodzaj procesora, na jakim dzia³a ta wersja Basha. IGNOREEOF Sterowanie akcj± pow³oki w przypadku odebrania znaku EOF jako jedynego wej¶cia. Je¶li zmienna jest ustawiona, jej warto¶ci± jest liczba znaków EOF, które mog± wyst±piæ w pustym wierszu przed zakoñczeniem pow³oki (domy¶lnie 10). Je¶li nie jest ustawiona, EOF oznacza koniec wej¶cia. MACHTYPE £añcuch opisuj±cy bie¿±cy system, na jakim dzia³a Bash. MAILCHECK Okre¶lenie jak czêsto (w sekundach) Bash ma sprawdzaæ obecno¶æ nowej poczty. MAILPATH Rozdzielona dwukropkami lista nazw plików, w których Bash ma sprawdzaæ obecno¶æ nowej poczty. OSTYPE Wersja Uniksa, na której dzia³a ta wersja Basha. PATH Rozdzielona dwukropkami lista katalogów do przeszukiwania przy wyszukiwaniu poleceñ. PROMPT_COMMAND Polecenie do wykonania przed wypisaniem ka¿dego g³ównego napisu zachêty. PS1 G³ówny napis zachêty. PS2 Drugorzêdny napis zachêty. PWD Pe³na ¶cie¿ka do bie¿±cego katalogu. SHELLOPTS Rozdzielona dwukropkami lista w³±czonych opcji pow³oki. TERM Nazwa typu bie¿±cego terminala. TIMEFORMAT Format wyj¶ciowy do statystyk czasu wy¶wietlanych przez polecenie wbudowane `time'. auto_resume Warto¶æ niepusta oznacza, ¿e s³owo polecenia wystêpuj±ce w linii jako jedyne jest najpierw wyszukiwane na li¶cie aktualnie zatrzymanych zadañ. Je¶li tam zostanie znalezione, to zadanie jest wznawiane jako pierwszoplanowe. Warto¶æ `exact' oznacza, ¿e s³owo polecenia musi dok³adnie pasowaæ do polecenia na li¶cie zadañ zatrzymanych. Warto¶æ `substring' oznacza, ¿e s³owo polecenia musi pasowaæ do podci±gu zadania. Ka¿da inna warto¶æ oznacza, ¿e polecenie musi byæ przedrostkiem zatrzymanego zadania. histchars Znaki steruj±ce rozwijaniem wg historii i szybkim podstawianiem. Pierwszy znak jest znakiem podstawiania historii, zwykle `!'. Drugi jest znakiem "szybkiego podstawienia", zwykle `^'. Trzeci znak jest znakiem "komentarza historii", zwykle `#'. HISTIGNORE Rozdzielona dwukropkami lista wzorców u¿ywanych przy decydowaniu, które polecenia powinny byæ zapisywane na li¶cie historii.

source: Add directories to stack. Adds a directory to the top of the directory stack, or rotates the stack, making the new top of the stack the current working directory. With no arguments, exchanges the top two directories. Options: -n Suppresses the normal change of directory when adding directories to the stack, so only the stack is manipulated. Arguments: +N Rotates the stack so that the Nth directory (counting from the left of the list shown by `dirs', starting with zero) is at the top. -N Rotates the stack so that the Nth directory (counting from the right of the list shown by `dirs', starting with zero) is at the top. dir Adds DIR to the directory stack at the top, making it the new current working directory. The `dirs' builtin displays the directory stack. Exit Status: Returns success unless an invalid argument is supplied or the directory change fails.
pl: Dodanie katalogów do stosu. Dodanie katalogu na wierzcho³ku stosu katalogów lub rotacja stosu czyni±ca jego nowym wierzcho³kiem bie¿±cy katalog roboczy. Wywo³ane bez argumentów zamienia na stosie dwa najwy¿sze katalogi. Opcje: -n Pominiêcie zmiany katalogu podczas umieszczania katalogów na stosie tak, ¿e zmieniany jest tylko stos. Argumenty: +N Rotacja stosu czyni±ca jego wierzcho³kiem N-ty katalog (licz±c od lewej strony listy wypisywanej przez `dirs', pocz±wszy od zera). -N Rotacja stosu czyni±ca jego wierzcho³kiem N-ty katalog (licz±c od prawej strony listy wypisywanej przez `dirs', pocz±wszy od zera). KATALOG Umieszczenie KATALOGU na wierzcho³ku stosu i uczynienie go nowym bie¿±cym katalogiem roboczym. Zawarto¶æ stosu katalogów mo¿na zobaczyæ za pomoc± polecenia `dirs'. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdny argument lub zmiana katalogu siê nie powiedzie.

source: Remove directories from stack. Removes entries from the directory stack. With no arguments, removes the top directory from the stack, and changes to the new top directory. Options: -n Suppresses the normal change of directory when removing directories from the stack, so only the stack is manipulated. Arguments: +N Removes the Nth entry counting from the left of the list shown by `dirs', starting with zero. For example: `popd +0' removes the first directory, `popd +1' the second. -N Removes the Nth entry counting from the right of the list shown by `dirs', starting with zero. For example: `popd -0' removes the last directory, `popd -1' the next to last. The `dirs' builtin displays the directory stack. Exit Status: Returns success unless an invalid argument is supplied or the directory change fails.
pl: Usuniêcie katalogów ze stosu. Usuniêcie pozycji ze stosu katalogów. Wywo³ane bez argumentów usuwa katalog z wierzcho³ka stosu i zmienia katalog bie¿±cy na katalog bêd±cy nowym wierzcho³kiem stosu. Opcje: -n Pominiêcie zmiany katalogu podczas usuwania katalogów ze stosu tak, ¿e zmieniany jest tylko stos. Argumenty: +N Usuniêcie ze stosu N-tej pozycji licz±c od lewej strony listy wypisywanej przez `dirs', pocz±wszy od zera. Na przyk³ad: `popd +0' usuwa pierwszy katalog, `popd +1' usuwa drugi. -N Usuniêcie ze stosu N-tej pozycji licz±c od prawej strony listy wypisywanej przez `dirs', pocz±wszy od zera. Na przyk³ad: `popd -0' usuwa pierwszy katalog, `popd -1' usuwa drugi. Zawarto¶æ stosu katalogów mo¿na zobaczyæ za pomoc± polecenia `dirs'. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdny argument lub zmiana katalogu siê nie powiedzie.

source: Display directory stack. Display the list of currently remembered directories. Directories find their way onto the list with the `pushd' command; you can get back up through the list with the `popd' command. Options: -c clear the directory stack by deleting all of the elements -l do not print tilde-prefixed versions of directories relative to your home directory -p print the directory stack with one entry per line -v print the directory stack with one entry per line prefixed with its position in the stack Arguments: +N Displays the Nth entry counting from the left of the list shown by dirs when invoked without options, starting with zero. -N Displays the Nth entry counting from the right of the list shown by dirs when invoked without options, starting with zero. Exit Status: Returns success unless an invalid option is supplied or an error occurs.
pl: Wypisanie stosu katalogów. Wypisanie listy aktualnie pamiêtanych katalogów. Katalogi umieszczane s± na li¶cie za pomoc± polecenia `pushd'; mo¿na cofaæ siê w obrêbie listy za pomoc± polecenia `popd'. Opcje: -c wyczyszczenie stosu katalogów poprzez usuniêcie wszystkich jego elementów -l nieu¿ywanie wersji skróconej wersji z tyld± przy wypisywaniu katalogów wzglêdem katalogu domowego -p wypisanie katalogów ze stosu w osobnych wierszach -v wypisanie katalogów ze stosu w osobnych wierszach, poprzedzaj±c ka¿dy jego pozycj± na stosie Argumenty: +N Wypisanie N-tej pozycji licz±c od lewej strony listy wypisywanej przez dirs wywo³ane bez opcji, pocz±wszy od zera. -N Wypisanie N-tej pozycji licz±c od prawej strony listy wypisywanej przez dirs wywo³ane bez opcji, pocz±wszy od zera. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub wyst±pi b³±d.

source: Set and unset shell options. Change the setting of each shell option OPTNAME. Without any option arguments, list all shell options with an indication of whether or not each is set. Options: -o restrict OPTNAMEs to those defined for use with `set -o' -p print each shell option with an indication of its status -q suppress output -s enable (set) each OPTNAME -u disable (unset) each OPTNAME Exit Status: Returns success if OPTNAME is enabled; fails if an invalid option is given or OPTNAME is disabled.
pl: Ustawianie i anulowanie opcji pow³oki. Zmiana ustawienia ka¿dej z NAZWY-OPCJI. Bez argumentów bêd±cych opcjami, wypisywane s± wszystkie opcje pow³oki z zaznaczeniem w³±czonych. Opcje: -o ograniczenie NAZW-OPCJI do u¿ywanych z `set -o' -p wypisanie opcji pow³oki z okre¶leniem stanu -q pominiêcie wyj¶cia -s w³±czenie (ustawienie) ka¿dej NAZWY-OPCJI -u wy³±czenie (anulowanie) ka¿dej NAZWY-OPCJI Stan wyj¶ciowy: Zwracana jest prawda je¶li NAZWA-OPCJI jest w³±czona; niepowodzenie, je¶li podano b³êdn± opcjê lub NAZWA-OPCJI jest wy³±czona.

source: Specify how arguments are to be completed by Readline. For each NAME, specify how arguments are to be completed. If no options are supplied, existing completion specifications are printed in a way that allows them to be reused as input. Options: -p print existing completion specifications in a reusable format -r remove a completion specification for each NAME, or, if no NAMEs are supplied, all completion specifications -D apply the completions and actions as the default for commands without any specific completion defined -E apply the completions and actions to "empty" commands -- completion attempted on a blank line When completion is attempted, the actions are applied in the order the uppercase-letter options are listed above. The -D option takes precedence over -E. Exit Status: Returns success unless an invalid option is supplied or an error occurs.
pl: Okre¶lenie sposobu dope³niania argumentów przez Readline. Okre¶lenie dla ka¿dej NAZWY sposobu dope³niania argumentów. Je¶li nie podano opcji, wypisywane s± istniej±ce specyfikacje dope³niania w sposób pozwalaj±cy na ich ponowne u¿ycie jako wej¶cie. Opcje: -p wypisanie istniej±cych dope³nieñ w formacie do ponownego u¿ycia -r usuniêcie specyfikacji dope³niania dla ka¿dej NAZWY lub, je¶li nie podano NAZW, wszystkich specyfikacji dope³niania -D stosowanie dope³niania i akcji domy¶lnie dla poleceñ bez okre¶lonych ¿adnych konkretnych regu³ dope³niania -E stosowanie dope³niania i akcji dla "pustych" poleceñ - próby dope³nienia w pustej linii Przy próbie dope³nienia akcje s± wykonywane w kolejno¶ci takiej, jak wielkie litery wymienione powy¿ej. Opcja -D ma priorytet nad -E. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub wyst±pi b³±d.

source: Display possible completions depending on the options. Intended to be used from within a shell function generating possible completions. If the optional WORD argument is supplied, matches against WORD are generated. Exit Status: Returns success unless an invalid option is supplied or an error occurs.
pl: Wypisanie mo¿liwych uzupe³nieñ w zale¿no¶ci od opcji. Przeznaczone do wykorzystania w funkcjach pow³oki generuj±cych mo¿liwe uzupe³nienia. Gdy podany jest opcjonalny argument S£OWO, generowane s± uzupe³nienia pasuj±ce do S£OWA. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub wyst±pi b³±d.

source: Modify or display completion options. Modify the completion options for each NAME, or, if no NAMEs are supplied, the completion currently being executed. If no OPTIONs are given, print the completion options for each NAME or the current completion specification. Options: -o option Set completion option OPTION for each NAME -D Change options for the "default" command completion -E Change options for the "empty" command completion Using `+o' instead of `-o' turns off the specified option. Arguments: Each NAME refers to a command for which a completion specification must have previously been defined using the `complete' builtin. If no NAMEs are supplied, compopt must be called by a function currently generating completions, and the options for that currently-executing completion generator are modified. Exit Status: Returns success unless an invalid option is supplied or NAME does not have a completion specification defined.
pl: Zmiana lub wy¶wietlenie opcji dope³niania. Zmiana opcji dope³niania dla ka¿dej NAZWY lub, je¶li nie podano NAZW, aktualnie wykonywanego dope³niania. Je¶li nie podano OPCJI, wypisanie opcji dope³niania dla ka¿dej NAZWY lub bie¿±cej specyfikacji dope³niania. Opcje: -o opcja Ustawienie podanej OPCJI dope³niania dla ka¿dej NAZWY -D Zmiana opcji dla "domy¶lnego" dope³niania polecenia -E Zmiana opcji dla dope³niania "pustego" polecenia U¿ycie `+o' zamiast `-o' wy³±cza podan± opcjê. Argumenty: Ka¿da NAZWA odnosi siê do polecenia, dla którego specyfikacja dope³niania musi byæ wcze¶niej zdefiniowana przy u¿yciu polecenia wbudowanego `complete'. Je¶li nie podano NAZW, compopt musi byæ wywo³ane z funkcji aktualnie generuj±cej dope³nienia, wtedy zmieniane s± opcje dla aktualnie wykonywanego generatora dope³nieñ. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub NAZWA nie ma zdefiniowanej specyfikacji dope³niania.

source: Read lines from the standard input into an indexed array variable. Read lines from the standard input into the indexed array variable ARRAY, or from file descriptor FD if the -u option is supplied. The variable MAPFILE is the default ARRAY. Options: -n count Copy at most COUNT lines. If COUNT is 0, all lines are copied. -O origin Begin assigning to ARRAY at index ORIGIN. The default index is 0. -s count Discard the first COUNT lines read. -t Remove a trailing newline from each line read. -u fd Read lines from file descriptor FD instead of the standard input. -C callback Evaluate CALLBACK each time QUANTUM lines are read. -c quantum Specify the number of lines read between each call to CALLBACK. Arguments: ARRAY Array variable name to use for file data. If -C is supplied without -c, the default quantum is 5000. When CALLBACK is evaluated, it is supplied the index of the next array element to be assigned and the line to be assigned to that element as additional arguments. If not supplied with an explicit origin, mapfile will clear ARRAY before assigning to it. Exit Status: Returns success unless an invalid option is given or ARRAY is readonly or not an indexed array.
pl: Odczyt linii ze standardowego wej¶cia do zmiennej tablicowej indeksowanej. Odczyt linii ze standardowego wej¶cia (lub deskryptora FD, je¶li podano opcjê -u) do zmiennej tablicowej indeksowanej TABLICA. Zmienna MAPFILE jest domy¶ln± TABLIC¡. Opcje: -n liczba Skopiowanie maksymalnie podanej LICZBY linii. Je¶li LICZBA wynosi 0, kopiowane s± wszystkie linie. -O pocz±tek Rozpoczêcie wpisywania do TABLICY od indeksu POCZ¡TKU. Domy¶lny indeks wynosi 0. -s liczba Pominiêcie pierwszych LICZBA odczytanych linii. -t Usuniêcie koñcowego znaku koñca linii z ka¿dej wczytanej linii. -u fd Odczyt linii z deskryptora FD zamiast standardowego wej¶cia. -C wywo³anie Obliczenie WYWO£ANIA po odczycie ka¿dego CO-ILE linii. -c CO-OLE Liczba linii do wczytania miêdzy ka¿dym WYWO£ANIEM. Argumenty: TABLICA Nazwa zmiennej tablicowej do u¿ycia na dane z pliku. Je¶li podano -C bez -c, domy¶lnym krokiem jest 5000. Podczas obliczania WYWO£ANIA jest przekazywany indeks do nastêpnego elementu tablicy, który ma byæ przypisany oraz - jako kolejne argumenty - linia do przypisania. Je¶li nie podano jawnie pocz±tku, mapfile czy¶ci TABLICÊ przed przypisywaniem. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub TABLICA jest tylko do odczytu, lub nie jest tablic± indeksowan±.

source: Read lines from a file into an array variable. A synonym for `mapfile'.
pl: Odczyt linii z pliku do zmiennej tablicowej. Synonim polecenia `mapfile'.
