Repository: bminor/bash
Catalog: po/*.po
Languages: pl

source: Enable and disable shell builtins. Enables and disables builtin shell commands. Disabling allows you to execute a disk command which has the same name as a shell builtin without using a full pathname. Options: -a print a list of builtins showing whether or not each is enabled -n disable each NAME or display a list of disabled builtins -p print the list of builtins in a reusable format -s print only the names of Posix `special' builtins Options controlling dynamic loading: -f Load builtin NAME from shared object FILENAME -d Remove a builtin loaded with -f Without options, each NAME is enabled. To use the `test' found in $PATH instead of the shell builtin version, type `enable -n test'. Exit Status: Returns success unless NAME is not a shell builtin or an error occurs.
pl: W³±czanie i wy³±czanie poleceñ wbudowanych pow³oki. W³±czanie i wy³±czanie poleceñ wbudowanych pow³oki. Wy³±czenie pozwala na wykonanie polecenia z dysku, maj±cego tê sam± nazwê, co polecenie wbudowane bez u¿ywania pe³nej ¶cie¿ki. Opcje: -a wypisanie listy poleceñ wbudowanych z informacj±, które s± w³±czone -n wy³±czenie ka¿dej NAZWY lub wypisanie listy wy³±czonych poleceñ -p wypisanie listy poleceñ w formacie do ponownego u¿ycia -s wypisanie tylko nazw posiksowych "specjalnych" poleceñ wbudowanych Opcje steruj±ce dynamicznym ³adowaniem: -f Wczytanie polecenia wbudowanego NAZWA z obiektu wspó³dzielonego PLIK -d Usuniêcie polecenia wczytanego przez -f Bez opcji w³±czana jest ka¿da NAZWA. Aby u¿yæ polecenia `test' z $PATH zamiast wersji wbudowanej, nale¿y wykonaæ `enable -n test'. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e NAZWA nie jest poleceniem wbudowanym lub wyst±pi b³±d.

source: Execute arguments as a shell command. Combine ARGs into a single string, use the result as input to the shell, and execute the resulting commands. Exit Status: Returns exit status of command or success if command is null.
pl: Wykonanie argumentów jako polecenia pow³oki. Po³±czenie argumentów ARG w pojedynczy ³añcuch, u¿ycie rezultatu jako wej¶cia dla pow³oki i wykonanie wynikowych poleceñ. Stan wyj¶ciowy: Zwracany jest stan wyj¶ciowy polecenia lub prawdê, je¶li polecenie jest puste.

source: Parse option arguments. Getopts is used by shell procedures to parse positional parameters as options. OPTSTRING contains the option letters to be recognized; if a letter is followed by a colon, the option is expected to have an argument, which should be separated from it by white space. Each time it is invoked, getopts will place the next option in the shell variable $name, initializing name if it does not exist, and the index of the next argument to be processed into the shell variable OPTIND. OPTIND is initialized to 1 each time the shell or a shell script is invoked. When an option requires an argument, getopts places that argument into the shell variable OPTARG. getopts reports errors in one of two ways. If the first character of OPTSTRING is a colon, getopts uses silent error reporting. In this mode, no error messages are printed. If an invalid option is seen, getopts places the option character found into OPTARG. If a required argument is not found, getopts places a ':' into NAME and sets OPTARG to the option character found. If getopts is not in silent mode, and an invalid option is seen, getopts places '?' into NAME and unsets OPTARG. If a required argument is not found, a '?' is placed in NAME, OPTARG is unset, and a diagnostic message is printed. If the shell variable OPTERR has the value 0, getopts disables the printing of error messages, even if the first character of OPTSTRING is not a colon. OPTERR has the value 1 by default. Getopts normally parses the positional parameters ($0 - $9), but if more arguments are given, they are parsed instead. Exit Status: Returns success if an option is found; fails if the end of options is encountered or an error occurs.
pl: Analiza opcji z argumentów. Polecenie getopts jest u¿ywane przez procedury pow³oki przy analizowaniu parametrów pozycyjnych jako opcji. £AÑCUCH-OPCJI zawiera litery opcji, które maj± byæ rozpoznane; je¶li po literze nastêpuje dwukropek, opcja wymaga argumentu, który powinien byæ oddzielony od opcji spacj±. Przy ka¿dym wywo³aniu getopts umieszcza nastêpn± opcjê w zmiennej pow³oki $nazwa, inicjuj±c j±, je¶li nie istnieje; natomiast indeks nastêpnego argumentu do przetworzenia jest umieszczany w zmiennej pow³oki OPTIND OPTIND jest inicjowany warto¶ci± 1 przy ka¿dym wywo³aniu pow³oki lub skryptu pow³oki. Je¶li opcja wymaga argumentu, getopts umieszcza ten argument w zmiennej pow³oki OPTARG. getopts zg³asza b³êdy na jeden z dwóch sposobów. Je¶li pierwszy znak £AÑCUCHA-OPCJI jest dwukropkiem, getopts wykorzystuje ciche zg³aszanie b³êdów. W tym trybie komunikaty b³êdów nie s± wypisywane. Je¶li napotkana zostanie b³êdna opcja, getopts umieszcza znak opcji w OPTARG. Je¶li nie znaleziono wymaganego argumentu, getopts umieszcza znak ':' w NAZWIE i ustawia OPTARG na napotkany znak opcji. Je¶li getopts nie jest w trybie cichym i napotkana zostanie b³êdna opcja, getopts umieszcza znak '?' w NAZWIE i anuluje OPTARG. Je¶li nie znaleziono wymaganego argumentu, w NAZWIE umieszczany jest znak '?', OPTARG jest anulowany i wypisywany jest komunikat diagnostyczny. Je¶li zmienna pow³oki OPTERR ma warto¶æ 0, getopts wy³±cza wypisywanie komunikatów b³êdów, nawet je¶li pierwszym znakiem £AÑCUCHA-OPCJI nie jest dwukropek. OPTERR domy¶lnie ma warto¶æ 1. Polecenie getopts normalnie przetwarza parametry pozycyjne ($0 - $9), ale je¶li podano wiêcej argumentów, s± one przetwarzane zamiast nich. Stan wyj¶ciowy: Zwracana jest prawda, je¶li napotkano opcjê; fa³sz, je¶li wyst±pi koniec opcji lub b³±d.

source: Replace the shell with the given command. Execute COMMAND, replacing this shell with the specified program. ARGUMENTS become the arguments to COMMAND. If COMMAND is not specified, any redirections take effect in the current shell. Options: -a name pass NAME as the zeroth argument to COMMAND -c execute COMMAND with an empty environment -l place a dash in the zeroth argument to COMMAND If the command cannot be executed, a non-interactive shell exits, unless the shell option `execfail' is set. Exit Status: Returns success unless COMMAND is not found or a redirection error occurs.
pl: Zast±pienie pow³oki podanym poleceniem. Wywo³ywane jest POLECENIE, zastêpuj±c tê pow³okê podanym programem. ARGUMENTY staj± siê argumentami POLECENIA. Je¶li nie podano POLECENIA, wszystkie podane przekierowania odnosz± skutek dla bie¿±cej pow³oki. Opcje: -a nazwa przekazanie NAZWY jako zerowego argumentu POLECENIA -c wywo³anie POLECENIA z pustym ¶rodowiskiem -l umieszczenie kreski w zerowym argumencie POLECENIA Je¶li polecenia nie mo¿na wywo³aæ, pow³oka nieinteraktywna koñczy siê, chyba ¿e ustawiona jest opcja pow³oki `execfail'. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e nie uda siê znale¼æ POLECENIA lub wyst±pi b³±d przekierowania.

source: Exit the shell. Exits the shell with a status of N. If N is omitted, the exit status is that of the last command executed.
pl: Opuszczenie pow³oki. Opuszczenie pow³oki z kodem zakoñczenia N. Je¶li N pominiêto, kodem zakoñczenia bêdzie kod zakoñczenia ostatniego wykonanego polecenia.

source: Exit a login shell. Exits a login shell with exit status N. Returns an error if not executed in a login shell.
pl: Opuszczenie pow³oki logowania. Opuszczenie pow³oki logowania z kodem zakoñczenia N. Zwraca b³±d, je¶li pow³oka nie jest pow³ok± logowania.

source: Display or execute commands from the history list. fc is used to list or edit and re-execute commands from the history list. FIRST and LAST can be numbers specifying the range, or FIRST can be a string, which means the most recent command beginning with that string. Options: -e ENAME select which editor to use. Default is FCEDIT, then EDITOR, then vi -l list lines instead of editing -n omit line numbers when listing -r reverse the order of the lines (newest listed first) With the `fc -s [pat=rep ...] [command]' format, COMMAND is re-executed after the substitution OLD=NEW is performed. A useful alias to use with this is r='fc -s', so that typing `r cc' runs the last command beginning with `cc' and typing `r' re-executes the last command. Exit Status: Returns success or status of executed command; non-zero if an error occurs.
pl: Wy¶wietlanie lub wykonywanie poleceñ z listy historii. fc s³u¿y do wypisywania, edycji i ponownego uruchamiania poleceñ z listy historii. PIERWSZY i OSTATNI jako liczby okre¶laj± zakres lub PIERWSZY jako napis oznacza najpó¼niej wykonywane polecenie zaczynaj±ce siê od tego napisu. Opcje: -e NAZWA-ED okre¶la edytor, który ma byæ u¿ywany. Domy¶lnymi warto¶ciami s±: najpierw FCEDIT, potem EDITOR, a na koñcu vi -l wypisywanie wierszy zamiast ich edycji -n niewypisywanie numerów wierszy -r odwrócenie kolejno¶ci wierszy (czyni±c najnowsze wypisane polecenie pierwszym) Przy wywo³aniu polecenia w postaci `fc -s [wz=zam ...] [polecenie]', jest ono wywo³ywane ponownie po wykonaniu podstawienia WZ=ZAM. Przydatnym aliasem korzystaj±cym z tego jest r='fc -s' tak, ¿e napisanie `r cc' uruchamia ostatnie polecenie zaczynaj±ce siê od `cc', a napisanie `r' uruchamia ponownie ostatnie polecenie. Stan wyj¶ciowy: Zwracana jest prawda lub stan wykonanego polecenia; warto¶æ niezerowa w przypadku b³êdu.

source: Move job to the foreground. Place the job identified by JOB_SPEC in the foreground, making it the current job. If JOB_SPEC is not present, the shell's notion of the current job is used. Exit Status: Status of command placed in foreground, or failure if an error occurs.
pl: Przeniesienie zadania na pierwszy plan. Umieszczenie ZADANIA na pierwszym planie oraz uczynienie go bie¿±cym zadaniem. Je¶li nie okre¶lono ZADANIA, u¿yte zostanie zadanie bie¿±ce w rozumieniu pow³oki. Stan wyj¶ciowy: Stan zadania umieszczonego na pierwszym planie lub fa³sz, je¶li wyst±pi b³±d.

source: Move jobs to the background. Place the jobs identified by each JOB_SPEC in the background, as if they had been started with `&'. If JOB_SPEC is not present, the shell's notion of the current job is used. Exit Status: Returns success unless job control is not enabled or an error occurs.
pl: Przeniesienie zadañ w t³o. Umieszczenie wszystkich ZADAÑ w tle tak, jakby zosta³y uruchomione z `&'. Je¶li nie okre¶lono ZADAÑ, u¿yte zostanie zadanie bie¿±ce w rozumieniu pow³oki. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e sterowanie zadaniami nie jest w³±czone lub wyst±pi b³±d.

source: Remember or display program locations. Determine and remember the full pathname of each command NAME. If no arguments are given, information about remembered commands is displayed. Options: -d forget the remembered location of each NAME -l display in a format that may be reused as input -p pathname use PATHNAME is the full pathname of NAME -r forget all remembered locations -t print the remembered location of each NAME, preceding each location with the corresponding NAME if multiple NAMEs are given Arguments: NAME Each NAME is searched for in $PATH and added to the list of remembered commands. Exit Status: Returns success unless NAME is not found or an invalid option is given.
pl: Zapamiêtanie lub wypisanie po³o¿enia programów. Okre¶lenie i zapamiêtanie pe³nej ¶cie¿ki ka¿dego polecenia NAZWA. Je¶li nie podano argumentów, wy¶wietlane s± informacje o zapamiêtanych poleceniach. Opcje: -d zapomnienie po³o¿enia ka¿dej NAZWY -l wypisanie w formacie do wykorzystania jako wej¶cie -p ¶cie¿ka u¿ycie ¦CIE¯KI jako pe³nej ¶cie¿ki NAZWY -r zapomnienie wszystkich pamiêtanych po³o¿eñ -t wypisanie pamiêtanych po³o¿eñ ka¿dej NAZWY poprzedzaj±c ka¿de po³o¿enie odpowiedni± NAZW¡, je¶li podano wiele NAZW Argumenty: NAZWA Ka¿da nazwa jest wyszukiwana w $PATH i dodawana do listy pamiêtanych poleceñ. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e nie znaleziono NAZWY lub podano b³êdn± opcjê.

source: Display information about builtin commands. Displays brief summaries of builtin commands. If PATTERN is specified, gives detailed help on all commands matching PATTERN, otherwise the list of help topics is printed. Options: -d output short description for each topic -m display usage in pseudo-manpage format -s output only a short usage synopsis for each topic matching PATTERN Arguments: PATTERN Pattern specifiying a help topic Exit Status: Returns success unless PATTERN is not found or an invalid option is given.
pl: Wy¶wietlenie informacji o poleceniach wbudowanych. Wy¶wietlenie krótkiego przegl±du poleceñ wbudowanych. Je¶li podano WZORZEC, wypisywany jest szczegó³owy opis wszystkich poleceñ pasuj±cych do WZORCA, w przeciwnym wypadku - lista tematów. Opcje: -d wypisanie krótkiego opisu ka¿dego tematu -m wy¶wietlenie sposobu u¿ycia w formacie zbli¿onym do stron man -s wypisanie tylko krótkiej informacji o sk³adni dla ka¿dego tematu pasuj±cego do WZORCA Argumenty: WZORZEC Wzorzec okre¶laj±cy temat pomocy Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e WZORCA nie znaleziono lub podano b³êdn± opcjê.

source: Display or manipulate the history list. Display the history list with line numbers, prefixing each modified entry with a `*'. An argument of N lists only the last N entries. Options: -c clear the history list by deleting all of the entries -d offset delete the history entry at offset OFFSET. -a append history lines from this session to the history file -n read all history lines not already read from the history file -r read the history file and append the contents to the history list -w write the current history to the history file and append them to the history list -p perform history expansion on each ARG and display the result without storing it in the history list -s append the ARGs to the history list as a single entry If FILENAME is given, it is used as the history file. Otherwise, if $HISTFILE has a value, that is used, else ~/.bash_history. If the $HISTTIMEFORMAT variable is set and not null, its value is used as a format string for strftime(3) to print the time stamp associated with each displayed history entry. No time stamps are printed otherwise. Exit Status: Returns success unless an invalid option is given or an error occurs.
pl: Wy¶wietlanie i modyfikowanie listy historii. Wy¶wietlanie listy historii z numerami linii z oznaczeniem ka¿dej zmodyfikowanej linii przedrostkiem `*'. Podanie argumentu N wypisuje tylko ostatnich N wpisów. Opcje: -c wyczyszczenie listy historii poprzez usuniêcie wszystkich wpisów -d offset usuniêcie wpisu historii o podanym OFFSECIE -a do³±czenie linii historii z tej sesji do pliku historii -n odczyt wszystkich jeszcze nie przeczytanych linii z pliku historii -r odczyt pliku historii i do³±czenie zawarto¶ci do listy historii -w zapis bie¿±cej historii do pliku historii -p rozwiniêcie wg historii ka¿dego ARG i wypisanie wyniku bez zapisywania go na li¶cie historii -s do³±czenie wszystkich ARG do listy historii jako pojedynczych wpisów Je¶li podano PLIK, jest u¿ywany jako plik historii. W przeciwnym wypadku u¿ywany jest $HISTFILE, a je¶li ta zmienna nie jest ustawiona - ~/.bash_history. Je¶li zmienna $HISTTIMEFORMAT jest ustawiona i niepusta, jej warto¶æ jest u¿ywana jako ³añcuch formatuj±cy dla strftime(3) do wypisywania momentu czasu powi±zanego z ka¿dym wypisywanym wpisem. W przeciwnym wypadku czas nie jest wypisywany. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub wyst±pi b³±d.

source: Display status of jobs. Lists the active jobs. JOBSPEC restricts output to that job. Without options, the status of all active jobs is displayed. Options: -l lists process IDs in addition to the normal information -n list only processes that have changed status since the last notification -p lists process IDs only -r restrict output to running jobs -s restrict output to stopped jobs If -x is supplied, COMMAND is run after all job specifications that appear in ARGS have been replaced with the process ID of that job's process group leader. Exit Status: Returns success unless an invalid option is given or an error occurs. If -x is used, returns the exit status of COMMAND.
pl: Wy¶wietlenie stanu zadañ. Wypisanie aktywnych zadañ. ZADANIE ogranicza wyj¶cie tylko do tego zadania. Bez opcji wypisywany jest stan wszystkich aktywnych zadañ. Opcje: -l wypisanie dodatkowo numerów PID procesów -n wypisanie tylko procesów, które zmieni³y stan od ostatniego powiadomienia -p wypisanie tylko numerów PID procesów -r ograniczenie wyj¶cia do zadañ dzia³aj±cych -s ograniczenie wyj¶cia do zadañ zatrzymanych Przy podaniu -x, uruchamiane jet polecenie podane POLECENIE po zast±pieniu ka¿dej z wystêpuj±cych w argumentach ARG specyfikacji zadañ numerem PID procesu wiod±cego danego zadania. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub wyst±pi b³±d. Je¶li u¿yto -x, zwracany jest stan wyj¶ciowy POLECENIA.

source: Remove jobs from current shell. Removes each JOBSPEC argument from the table of active jobs. Without any JOBSPECs, the shell uses its notion of the current job. Options: -a remove all jobs if JOBSPEC is not supplied -h mark each JOBSPEC so that SIGHUP is not sent to the job if the shell receives a SIGHUP -r remove only running jobs Exit Status: Returns success unless an invalid option or JOBSPEC is given.
pl: Usuniêcie poleceñ z bie¿±cej pow³oki. Usuniêcie ka¿dego podanego ZADANIA z tablicy aktywnych zadañ. Bez podania ZADANIA pow³oka u¿ywa pojêcia bie¿±cego zadania. Opcje: -a usuniêcie wszystkich zadañ, je¶li nie podano ZADANIA -h oznaczenie ka¿dego zadania tak, ¿e SIGHUP nie jest wysy³any do zadania, je¶li pow³oka otrzyma SIGHUP -r usuniêcie tylko dzia³aj±cych zadañ Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdn± opcjê lub ZADANIE.

source: Send a signal to a job. Send the processes identified by PID or JOBSPEC the signal named by SIGSPEC or SIGNUM. If neither SIGSPEC nor SIGNUM is present, then SIGTERM is assumed. Options: -s sig SIG is a signal name -n sig SIG is a signal number -l list the signal names; if arguments follow `-l' they are assumed to be signal numbers for which names should be listed Kill is a shell builtin for two reasons: it allows job IDs to be used instead of process IDs, and allows processes to be killed if the limit on processes that you can create is reached. Exit Status: Returns success unless an invalid option is given or an error occurs.
pl: Wys³anie sygna³u do zadania. Wys³anie do procesów okre¶lonych przez PID lub ZADANIE sygna³u o nazwie SYGNA£ lub NUMERZE-SYGNA£U. Je¶li nie podano SYGNA£U ani NUMERU-SYGNA£U, przyjmowany jest SIGTERM. Opcje: -s SYG SYG jest nazw± sygna³u -n SYG SYG jest numerem sygna³u -l lista nazw sygna³ów; je¶li `-l' wystêpuje z argumentami, s± one traktowane jako numery sygna³ów, dla których maj± byæ wypisane nazwy Kill jest poleceniem wewnêtrznym z dwóch powodów: umo¿liwia korzystanie z identyfikatorów zadañ zamiast numerów PID oraz, w przypadku osi±gniêcia ograniczenia na liczbê procesów, nie powoduje potrzeby uruchamiania dodatkowego procesu, aby jaki¶ zabiæ. Stan wyj¶ciowy: Zwracany jest sukces, chyba ¿e podano b³êdn± opcjê lub wyst±pi b³±d.

source: Evaluate arithmetic expressions. Evaluate each ARG as an arithmetic expression. Evaluation is done in fixed-width integers with no check for overflow, though division by 0 is trapped and flagged as an error. The following list of operators is grouped into levels of equal-precedence operators. The levels are listed in order of decreasing precedence. id++, id-- variable post-increment, post-decrement ++id, --id variable pre-increment, pre-decrement -, + unary minus, plus !, ~ logical and bitwise negation ** exponentiation *, /, % multiplication, division, remainder +, - addition, subtraction <<, >> left and right bitwise shifts <=, >=, <, > comparison ==, != equality, inequality & bitwise AND ^ bitwise XOR | bitwise OR && logical AND || logical OR expr ? expr : expr conditional operator =, *=, /=, %=, +=, -=, <<=, >>=, &=, ^=, |= assignment Shell variables are allowed as operands. The name of the variable is replaced by its value (coerced to a fixed-width integer) within an expression. The variable need not have its integer attribute turned on to be used in an expression. Operators are evaluated in order of precedence. Sub-expressions in parentheses are evaluated first and may override the precedence rules above. Exit Status: If the last ARG evaluates to 0, let returns 1; let returns 0 otherwise.
pl: Obliczanie wyra¿eñ arytmetycznych. Obliczenie ka¿dego argumentu ARG jako wyra¿enia arytmetycznego. Obliczenia s± wykonywane dla liczb ca³kowitych o sta³ej d³ugo¶ci bez sprawdzania przepe³nienia, jednak¿e dzielenie przez 0 jest przechwytywane i oznaczane jako b³±d. Poni¿sza lista operatorów jest pogrupowana na poziomy operatorów o jednakowym priorytecie. Poziomy s± wypisane w kolejno¶ci malej±cego priorytetu. id++, id-- post-inkrementacja, post-dekrementacja zmiennej ++id, --id pre-inkrementacja, pre-dekrementacja zmiennej -, + jednoargumentowy minus, plus !, ~ logiczna i bitowa negacja ** potêgowanie *, /, % mno¿enie, dzielenie, reszta z dzielenia +, - dodawanie, odejmowanie <<, >> przesuniêcie bitowe w lewo i w prawo <=, >=, <, > porównanie ==, != równo¶æ, nierówno¶æ & bitowe AND ^ bitowe XOR | bitowe OR && logiczne AND || logiczne OR expr ? expr : expr operator warunkowy =, *=, /=, %=, +=, -=, <<=, >>=, &=, ^=, |= przypisanie Jako operandy mog± wystêpowaæ zmienne pow³oki. Nazwa zmiennej jest zastêpowana w w wyra¿eniu jej warto¶ci± (po konwersji do liczby ca³kowitej o sta³ej d³ugo¶ci). Zmienna, aby mog³a byæ u¿yta w wyra¿eniu, nie musi mieæ ustawionego atrybutu integer. Operacje s± wykonywane wg. priorytetów operatorów. Najpierw s± wykonywane podwyra¿enia w nawiasach i maj± one pierwszeñstwo przed powy¿szymi priorytetami operatorów. Stan wyj¶ciowy: Je¶li warto¶ci± ostatniego argumentu jest 0, let zwraca 1; w pozosta³ych przypadkach zwracane jest 0.

source: Return from a shell function. Causes a function or sourced script to exit with the return value specified by N. If N is omitted, the return status is that of the last command executed within the function or script. Exit Status: Returns N, or failure if the shell is not executing a function or script.
pl: Powrót z funkcji pow³oki. Polecenie powoduje, ¿e funkcja lub w³±czony skrypt koñczy siê zwracaj±c warto¶æ podan± jako N. Je¶li pominiêto N, stanem wyj¶ciowym bêdzie stan ostatniego polecenia wykonanego w funkcji lub skrypcie. Stan wyj¶ciowy: Zwracane jest N lub niepowodzenie, je¶li pow³oka nie wykonuje ¿adnej funkcji ani skryptu.

source: Set export attribute for shell variables. Marks each NAME for automatic export to the environment of subsequently executed commands. If VALUE is supplied, assign VALUE before exporting. Options: -f refer to shell functions -n remove the export property from each NAME -p display a list of all exported variables and functions An argument of `--' disables further option processing. Exit Status: Returns success unless an invalid option is given or NAME is invalid.
pl: Ustawienie atrybutu eksportowania dla zmiennych pow³oki. Zaznaczenie ka¿dej NAZWY do automatycznego eksportowania do ¶rodowiska pó¼niej wywo³ywanych poleceñ. Je¶li podano WARTO¦Æ, jest ona przypisywana przed eksportowaniem. Opcje: -f dzia³anie na funkcjach pow³oki -n usuniêcie atrybutu eksportowania z ka¿dej NAZWY -p wy¶wietlenie listy wszystkich eksportowanych zmiennych i funkcji Argument `--' koñczy dalsze przetwarzanie opcji. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano nieprawid³ow± opcjê lub NAZWÊ.
