Repository: bminor/bash
Catalog: po/*.po
Languages: pl

source: bad array subscript
pl: nieprawid³owy indeks tablicy

source: %s: cannot convert indexed to associative array
pl: %s: nie mo¿na przekszta³ciæ tablicy indeksowanej na asocjacyjn±

source: %s: invalid associative array key
pl: %s: b³êdny klucz tablicy asocjacyjnej

source: %s: cannot assign to non-numeric index
pl: %s: nie mo¿na przypisaæ do nienumerycznego indeksu

source: %s: %s: must use subscript when assigning associative array
pl: %s: %s: przy przypisaniu do tablicy asocjacyjnej nale¿y u¿yæ nawiasów

source: %s: cannot create: %s
pl: %s: nie mo¿na utworzyæ: %s

source: bash_execute_unix_command: cannot find keymap for command
pl: bash_execute_unix_command: nie mo¿na znale¼æ mapy klawiszy dla polecenia

source: %s: first non-whitespace character is not `"'
pl: %s: pierwszym drukowalnym znakiem nie jest `"'

source: no closing `%c' in %s
pl: brak zamykaj±cego `%c' w %s

source: %s: missing colon separator
pl: %s: brak separuj±cego dwukropka

source: `%s': invalid alias name
pl: `%s': b³êdna nazwa aliasu

source: line editing not enabled
pl: edycja wiersza nie zosta³a w³±czona

source: `%s': invalid keymap name
pl: `%s': nieprawid³owa nazwa mapy klawiszy

source: %s: cannot read: %s
pl: %s: nie mo¿na odczytaæ: %s

source: `%s': cannot unbind
pl: `%s': nie mo¿na usun±æ dowi±zania

source: `%s': unknown function name
pl: `%s': nie znana nazwa funkcji

source: %s is not bound to any keys.
pl: %s nie jest przypisany do ¿adnego klawisza.

source: %s can be invoked via
pl: %s mo¿e byæ wywo³any przez

source: loop count
pl: licznik pêtli

source: only meaningful in a `for', `while', or `until' loop
pl: ma sens tylko w pêtli `for', `while' lub `until'

source: Returns the context of the current subroutine call. Without EXPR, returns
pl: Zwraca kontekst wywo³ania bie¿±cego podprogramu. Bez WYRA¯ENIA zwraca

source: HOME not set
pl: Nie ustawiono HOME

source: too many arguments
pl: za du¿o argumentów

source: OLDPWD not set
pl: Nie ustawiono OLDPWD

source: line %d:
pl: linia %d:

source: warning:
pl: uwaga:

source: %s: usage:
pl: %s: sk³adnia:

source: %s: option requires an argument
pl: %s: opcja wymaga argumentu

source: %s: numeric argument required
pl: %s: wymagany argument numeryczny

source: %s: not found
pl: %s: nie znaleziono

source: %s: invalid option
pl: %s: nieprawid³owa opcja

source: %s: invalid option name
pl: %s: nieprawid³owa nazwa opcji

source: `%s': not a valid identifier
pl: `%s': nieprawid³owy identyfikator

source: invalid octal number
pl: b³êdna liczba ósemkowa

source: invalid hex number
pl: b³êdna liczba szesnastkowa

source: invalid number
pl: nieprawid³owa liczba

source: %s: invalid signal specification
pl: %s: nieprawid³owo okre¶lony sygna³

source: `%s': not a pid or valid job spec
pl: `%s': nie jest to nr PID ani prawid³owe okre¶lenie zadania

source: %s: readonly variable
pl: %s: zmienna tylko do odczytu

source: %s: %s out of range
pl: %s: %s poza zakresem

source: %s out of range
pl: %s poza zakresem

source: %s: no such job
pl: %s: brak takiego zadania

source: %s: no job control
pl: %s: brak kontroli zadañ

source: no job control
pl: brak kontroli zadañ

source: %s: restricted
pl: %s: ograniczony

source: restricted
pl: ograniczony

source: %s: not a shell builtin
pl: %s: nie jest to polecenie pow³oki

source: write error: %s
pl: b³±d zapisu: %s

source: error setting terminal attributes: %s
pl: b³±d podczas ustawiania atrybutów terminala: %s

source: error getting terminal attributes: %s
pl: b³±d podczas pobierania atrybutów terminala: %s

source: %s: error retrieving current directory: %s: %s
pl: %s: b³±d przy okre¶laniu katalogu bie¿±cego: %s: %s

source: %s: ambiguous job spec
pl: %s: niejednoznaczne okre¶lenie zadania

source: %s: invalid action name
pl: %s: nieprawid³owa nazwa akcji

source: %s: no completion specification
pl: %s: brak definicji dla uzupe³nienia

source: warning: -F option may not work as you expect
pl: uwaga: opcja -F mo¿e dzia³aæ inaczej ni¿ oczekiwano

source: warning: -C option may not work as you expect
pl: uwaga: opcja -C mo¿e dzia³aæ inaczej ni¿ oczekiwano

source: not currently executing completion function
pl: aktualnie nie jest wykonywana funkcja dope³niania

source: can only be used in a function
pl: mo¿na u¿ywaæ tylko w funkcji

source: cannot use `-f' to make functions
pl: nie mo¿na u¿ywaæ `-f' do tworzenia funkcji

source: %s: readonly function
pl: %s: funkcja tylko do odczytu

source: %s: cannot destroy array variables in this way
pl: %s: nie mo¿na w ten sposób unicestwiæ zmiennej tablicowej

source: %s: cannot convert associative to indexed array
pl: %s: nie mo¿na przekszta³ciæ tablicy asocjacyjnej na indeksowan±

source: dynamic loading not available
pl: ³adowanie dynamiczne nie jest dostêpne

source: cannot open shared object %s: %s
pl: nie mo¿na otworzyæ obiektu wspó³dzielonego %s: %s

source: cannot find %s in shared object %s: %s
pl: nie mo¿na znale¼æ %s w obiekcie wspó³dzielonym %s: %s

source: %s: not dynamically loaded
pl: %s: nie jest ³adowany dynamicznie

source: %s: cannot delete: %s
pl: %s: nie mo¿na usun±æ: %s

source: %s: is a directory
pl: %s: jest katalogiem

source: %s: not a regular file
pl: %s: nie jest zwyk³ym plikiem

source: %s: file is too large
pl: %s: plik jest za du¿y

source: %s: cannot execute binary file
pl: %s: nie mo¿na uruchomiæ pliku binarnego

source: %s: cannot execute: %s
pl: %s: nie mo¿na uruchomiæ: %s

source: logout
pl: wylogowanie

source: not login shell: use `exit'
pl: to nie jest pow³oka logowania: u¿yj `exit'

source: There are stopped jobs.
pl: Istniej± zatrzymane zadania.

source: There are running jobs.
pl: Istniej± dzia³aj±ce zadania.

source: no command found
pl: nie znaleziono polecenia

source: history specification
pl: specyfikacja historii

source: %s: cannot open temp file: %s
pl: %s: nie uda³o siê otworzyæ pliku tymczasowego: %s

source: current
pl: bie¿±ce

source: job %d started without job control
pl: zadanie %d uruchomiono bez kontroli zadañ

source: %s: illegal option -- %c
pl: %s: niedozwolona opcja -- %c

source: %s: option requires an argument -- %c
pl: %s: opcja wymaga argumentu -- %c

source: hashing disabled
pl: zapamiêtywanie ¶cie¿ek poleceñ w tablicy asocjacyjnej wy³±czone

source: %s: hash table empty
pl: %s: tablica asocjacyjna pusta

source: hits command
pl: trafienia polecenie

source: Shell commands matching keyword `
pl: Polecenia pow³oki pasuj±ce do s³owa kluczowego `

source: no help topics match `%s'. Try `help help' or `man -k %s' or `info %s'.
pl: ¿aden temat pomocy nie pasuje do `%s'. Spróbuj `help help', `man -k %s' lub `info %s'.

source: %s: cannot open: %s
pl: %s: nie mo¿na otworzyæ: %s

source: These shell commands are defined internally. Type `help' to see this list. Type `help name' to find out more about the function `name'. Use `info bash' to find out more about the shell in general. Use `man -k' or `info' to find out more about commands not in this list. A star (*) next to a name means that the command is disabled.
pl: Te polecenia pow³oki s± poleceniami wewnêtrznymi. Napisz `help', aby zobaczyæ listê. Napisz `help nazwa', aby otrzymaæ wiêcej informacji o funkcji `nazwa'. U¿yj `info bash', aby otrzymaæ wiêcej informacji ogólnych o pow³oce. U¿yj `man -k' lub `info', aby otrzymaæ wiêcej informacji o poleceniach z tej listy. Gwiazdka (*) po nazwie oznacza, ¿e dane polecenie jest wy³±czone.

source: cannot use more than one of -anrw
pl: nie mo¿na u¿ywaæ wiêcej ni¿ jednego spo¶ród -anrw

source: history position
pl: pozycja historii

source: %s: history expansion failed
pl: %s: rozwiniêcie wg historii nie powiod³o siê

source: %s: inlib failed
pl: %s: inlib nie powiod³o siê

source: no other options allowed with `-x'
pl: nie mo¿na u¿ywaæ innych opcji przy `-x'

source: %s: arguments must be process or job IDs
pl: %s: argumentami musz± byæ numery procesów lub zadañ

source: Unknown error
pl: Nieznany b³±d

source: expression expected
pl: spodziewano siê wyra¿enia

source: %s: not an indexed array
pl: %s: nie jest tablic± indeksowan±

source: %s: invalid file descriptor specification
pl: %s: nieprawid³owo okre¶lony deskryptor pliku

source: %d: invalid file descriptor: %s
pl: %d: nieprawid³owy deskryptor pliku: %s

source: %s: invalid line count
pl: %s: b³êdna liczba linii

source: %s: invalid array origin
pl: %s: b³êdny pocz±tek tablicy

source: %s: invalid callback quantum
pl: %s: b³êdna liczba linii miêdzy wywo³aniami

source: empty array variable name
pl: pusta nazwa zmiennej tablicowej

source: array variable support required
pl: wymagana obs³uga zmiennych tablicowych

source: `%s': missing format character
pl: `%s': brak znaku formatuj±cego

source: `%c': invalid time format specification
pl: `%c': b³êdne okre¶lenie formatu czasu

source: `%c': invalid format character
pl: `%c': nieprawid³owy znak formatuj±cy

source: warning: %s: %s
pl: uwaga: %s: %s

source: missing hex digit for \x
pl: brak cyfry szesnastkowej dla \x

source: missing unicode digit for \%c
pl: brak cyfry unikodowej dla \%c

source: no other directory
pl: brak innego katalogu

source: <no current directory>
pl: <brak katalogu bie¿±cego>

source: directory stack empty
pl: pusty stos katalogów

source: directory stack index
pl: indeks stosu katalogów

source: Display the list of currently remembered directories. Directories find their way onto the list with the `pushd' command; you can get back up through the list with the `popd' command. Options: -c clear the directory stack by deleting all of the elements -l do not print tilde-prefixed versions of directories relative to your home directory -p print the directory stack with one entry per line -v print the directory stack with one entry per line prefixed with its position in the stack Arguments: +N Displays the Nth entry counting from the left of the list shown by dirs when invoked without options, starting with zero. -N Displays the Nth entry counting from the right of the list shown by dirs when invoked without options, starting with zero.
pl: Wypisanie listy aktualnie pamiêtanych katalogów. Katalogi umieszczane s± na li¶cie za pomoc± polecenia `pushd'; mo¿na cofaæ siê w obrêbie listy za pomoc± polecenia `popd'. Opcje: -c wyczyszczenie stosu katalogów poprzez usuniêcie wszystkich elementów -l niewypisywanie katalogów wzglêdem kat. domowego u¿ytkownika w postaci skróconej z tyld± -p wypisanie stosu katalogów po jednym wpisie w linii -v wypisanie stosu katalogów po jednym wpisie w linii, poprzedzonych pozycj± na stosie Argumenty: +N Wypisanie N-tej pozycji licz±c od lewej strony listy wypisywanej przez dirs wywo³ane bez opcji, pocz±wszy od zera. -N Wypisanie N-tej pozycji licz±c od prawej strony listy wypisywanej przez dirs wywo³ane bez opcji, pocz±wszy od zera.

source: Adds a directory to the top of the directory stack, or rotates the stack, making the new top of the stack the current working directory. With no arguments, exchanges the top two directories. Options: -n Suppresses the normal change of directory when adding directories to the stack, so only the stack is manipulated. Arguments: +N Rotates the stack so that the Nth directory (counting from the left of the list shown by `dirs', starting with zero) is at the top. -N Rotates the stack so that the Nth directory (counting from the right of the list shown by `dirs', starting with zero) is at the top. dir Adds DIR to the directory stack at the top, making it the new current working directory. The `dirs' builtin displays the directory stack.
pl: Dodanie katalogu na wierzcho³ku stosu katalogów lub rotacja stosu czyni±ca jego nowym wierzcho³kiem bie¿±cy katalog roboczy. Wywo³ane bez argumentów zamienia na stosie dwa najwy¿sze katalogi. Opcje: -n Pominiêcie zmiany katalogu podczas umieszczania katalogów na stosie tak, ¿e zmieniany jest tylko stos. Argumenty: +N Rotacja stosu czyni±ca jego wierzcho³kiem N-ty katalog (licz±c od lewej strony listy wypisywanej przez `dirs', pocz±wszy od zera). -N Rotacja stosu czyni±ca jego wierzcho³kiem N-ty katalog (licz±c od prawej strony listy wypisywanej przez `dirs', pocz±wszy od zera). katalog Umieszczenie KATALOGU na wierzcho³ku stosu i uczynienie go nowym bie¿±cym katalogiem roboczym. Zawarto¶æ stosu katalogów mo¿na zobaczyæ za pomoc± polecenia `dirs'.

source: Removes entries from the directory stack. With no arguments, removes the top directory from the stack, and changes to the new top directory. Options: -n Suppresses the normal change of directory when removing directories from the stack, so only the stack is manipulated. Arguments: +N Removes the Nth entry counting from the left of the list shown by `dirs', starting with zero. For example: `popd +0' removes the first directory, `popd +1' the second. -N Removes the Nth entry counting from the right of the list shown by `dirs', starting with zero. For example: `popd -0' removes the last directory, `popd -1' the next to last. The `dirs' builtin displays the directory stack.
pl: Usuniêcie pozycji ze stosu katalogów. Wywo³ane bez argumentów usuwa katalog z wierzcho³ka stosu i zmienia katalog bie¿±cy na katalog bêd±cy nowym wierzcho³kiem stosu. Opcje: -n Pominiêcie zmiany katalogu podczas usuwania katalogów ze stosu tak, ¿e zmieniany jest tylko stos. Argumenty: +N Usuniêcie ze stosu N-tej pozycji licz±c od lewej strony listy wypisywanej przez `dirs', pocz±wszy od zera. Na przyk³ad: `popd +0' usuwa pierwszy katalog, `popd +1' usuwa drugi. -N Usuniêcie ze stosu N-tej pozycji licz±c od prawej strony listy wypisywanej przez `dirs', pocz±wszy od zera. Na przyk³ad: `popd -0' usuwa ostatni katalog, `popd -1' usuwa poprzedni. Zawarto¶æ stosu katalogów mo¿na zobaczyæ za pomoc± polecenia `dirs'.

source: %s: invalid timeout specification
pl: %s: nieprawid³owo okre¶lony limit czasu

source: read error: %d: %s
pl: b³±d odczytu: %d: %s

source: can only `return' from a function or sourced script
pl: wyj¶cie przez `return' mo¿liwe tylko z funkcji lub skryptu

source: cannot simultaneously unset a function and a variable
pl: nie mo¿na jednocze¶nie anulowaæ definicji funkcji i zmiennej

source: %s: cannot unset
pl: %s: nie mo¿na anulowaæ definicji

source: %s: cannot unset: readonly %s
pl: %s: nie mo¿na anulowaæ definicji: %s jest tylko do odczytu

source: %s: not an array variable
pl: %s: nie jest zmienn± tablicow±

source: %s: not a function
pl: %s: nie jest funkcj±

source: shift count
pl: licznik przesuniêcia

source: cannot set and unset shell options simultaneously
pl: nie mo¿na opcji pow³oki jednocze¶nie ustawiæ i uniewa¿niæ

source: %s: invalid shell option name
pl: %s: nieprawid³owa nazwa opcji pow³oki

source: filename argument required
pl: wymagany argument w postaci nazwy pliku

source: %s: file not found
pl: %s: nie znaleziono pliku

source: cannot suspend
pl: nie mo¿na wstrzymaæ

source: cannot suspend a login shell
pl: nie mo¿na wstrzymaæ pow³oki logowania

source: %s is aliased to `%s'
pl: %s jest aliasem do %s'

source: %s is a shell keyword
pl: %s jest s³owem kluczowym pow³oki

source: %s is a function
pl: %s jest funkcj±

source: %s is a shell builtin
pl: %s jest wewnêtrznym poleceniem pow³oki

source: %s is %s
pl: %s jest %s

source: %s is hashed (%s)
pl: ¶cie¿ka do %s jest zapamiêtana (%s)

source: %s: invalid limit argument
pl: %s: nieprawid³owy argument stanowi±cy ograniczenie

source: `%c': bad command
pl: `%c': z³e polecenie

source: %s: cannot get limit: %s
pl: %s: nie mo¿na odczytaæ ograniczenia: %s

source: limit
pl: ograniczenie

source: %s: cannot modify limit: %s
pl: %s: nie mo¿na zmieniæ ograniczenia: %s

source: octal number
pl: liczba ósemkowa

source: `%c': invalid symbolic mode operator
pl: `%c': nieprawid³owy operator trybu symbolicznego

source: `%c': invalid symbolic mode character
pl: `%c': nieprawid³owy znak trybu symbolicznego

source: line
pl: linia

source: last command: %s
pl: ostatnie polecenie: %s

source: Aborting...
pl: Przerywanie...

source: unknown command error
pl: nieznany b³±d polecenia

source: bad command type
pl: z³y rodzaj polecenia

source: bad connector
pl: z³y ³±cznik

source: bad jump
pl: z³y skok

source: %s: unbound variable
pl: %s: nieustawiona zmienna

source: atimed out waiting for input: auto-logout
pl: aprzekroczony czas oczekiwania na dane wej¶ciowe: auto-wylogowanie

source: cannot redirect standard input from /dev/null: %s
pl: nie mo¿na przekierowaæ standardowego wej¶cia z /dev/null: %s

source: TIMEFORMAT: `%c': invalid format character
pl: TIMEFORMAT: `%c': nieprawid³owy znak formatuj±cy

source: pipe error
pl: b³±d potoku

source: %s: restricted: cannot specify `/' in command names
pl: %s: ograniczony: nie mo¿na podawaæ `/' w nazwach poleceñ

source: %s: command not found
pl: %s: nie znaleziono polecenia

source: %s: %s: bad interpreter
pl: %s: %s: z³y interpreter

source: cannot duplicate fd %d to fd %d
pl: nie mo¿na skopiowaæ deskryptora pliku %d do %d

source: expression recursion level exceeded
pl: przekroczone ograniczenie poziomu rekursji dla wyra¿enia

source: recursion stack underflow
pl: niedomiar stosu rekursji

source: syntax error in expression
pl: b³±d sk³adniowy w wyra¿eniu

source: attempted assignment to non-variable
pl: próba przypisania do nie-zmiennej

source: division by 0
pl: dzielenie przez 0

source: bug: bad expassign token
pl: b³±d: z³y prefiks operatora przypisuj±cego

source: `:' expected for conditional expression
pl: spodziewano siê `:' w wyra¿eniu warunkowym

source: exponent less than 0
pl: wyk³adnik mniejszy ni¿ 0

source: identifier expected after pre-increment or pre-decrement
pl: spodziewany identyfikator po operatorze preinkrementacji lub predekrementacji

source: missing `)'
pl: brakuj±cy `)'

source: syntax error: operand expected
pl: b³±d sk³adni: spodziewany argument

source: syntax error: invalid arithmetic operator
pl: b³±d sk³adni: nieprawid³owy operator arytmetyczny

source: %s%s%s: %s (error token is "%s")
pl: %s%s%s: %s (b³êdny znacznik to "%s")

source: invalid arithmetic base
pl: nieprawid³owa podstawa arytmetyczna

source: value too great for base
pl: warto¶æ za du¿a na podstawê

source: %s: expression error
pl: %s: b³±d w wyra¿eniu

source: getcwd: cannot access parent directories
pl: getcwd: niemo¿liwy dostêp do katalogów nadrzêdnych

source: cannot reset nodelay mode for fd %d
pl: nie mo¿na wy³±czyæ trybu nieblokuj±cego dla deskryptora %d

source: cannot allocate new file descriptor for bash input from fd %d
pl: nie mo¿na przydzieliæ nowego deskryptora pliku dla wej¶cia basha z %d

source: save_bash_input: buffer already exists for new fd %d
pl: save_bash_input: bufor dla nowego deskryptora %d ju¿ istnieje

source: forked pid %d appears in running job %d
pl: proces o PID %d wystêpuje w dzia³aj±cym zadaniu %d

source: deleting stopped job %d with process group %ld
pl: usuwanie zatrzymanego zadania %d z grup± procesów %ld

source: add_process: process %5ld (%s) in the_pipeline
pl: add_process: proces %5ld (%s) w potoku

source: add_process: pid %5ld (%s) marked as still alive
pl: add_process: pid %5ld (%s) oznaczony jako nadal ¿ywy

source: describe_pid: %ld: no such pid
pl: describe_pid: %ld: brak takiego PID-u

source: Signal %d
pl: Sygna³ %d

source: Done
pl: Zakoñczono

source: Stopped
pl: Zatrzymano

source: Stopped(%s)
pl: Zatrzymano(%s)

source: Running
pl: Dzia³a

source: Done(%d)
pl: Zakoñczono(%d)

source: Exit %d
pl: Kod wyj¶cia %d

source: Unknown status
pl: Stan nieznany

source: (core dumped)
pl: (zrzut pamiêci)

source: (wd: %s)
pl: (katalog: %s)

source: child setpgid (%ld to %ld)
pl: setpgid potomka (%ld na %ld)

source: wait: pid %ld is not a child of this shell
pl: wait: PID %ld nie jest potomkiem tej pow³oki

source: wait_for: No record of process %ld
pl: wait_for: Brak rekordu dla procesu %ld

source: wait_for_job: job %d is stopped
pl: wait_for_job: zadanie %d jest zatrzymane

source: %s: job has terminated
pl: %s: zadanie zosta³o przerwane

source: %s: job %d already in background
pl: %s: zadanie %d ju¿ pracuje w tle

source: waitchld: turning on WNOHANG to avoid indefinite block
pl: waitchld: wy³±czanie WNOHANG w celu unikniêcia nieskoñczonego oczekiwania

source: %s: line %d:
pl: %s: linia %d:

source: (core dumped)
pl: (zrzut pamiêci)

source: (wd now: %s)
pl: (katalog: %s)

source: initialize_job_control: getpgrp failed
pl: initialize_job_control: getpgrp nie powiod³o siê

source: initialize_job_control: line discipline
pl: initialize_job_control: dyscyplina linii

source: cannot set terminal process group (%d)
pl: nie mo¿na ustawiæ grupy procesów terminala (%d)

source: no job control in this shell
pl: w tej pow³oce nie ma kontroli zadañ

source: malloc: failed assertion: %s
pl: malloc: za³o¿enie, ¿e %s nie jest spe³nione

source: malloc: %s:%d: assertion botched
pl: malloc: %s:%d: spartaczone za³o¿enie

source: unknown
pl: nieznany

source: malloc: block on free list clobbered
pl: malloc: nieprawid³owy blok na li¶cie wolnych bloków

source: free: called with already freed block argument
pl: free: wywo³ane dla bloku, który ju¿ zosta³ zwolniony

source: free: called with unallocated block argument
pl: free: wywo³ane dla bloku, który nie zosta³ przydzielony

source: free: underflow detected; mh_nbytes out of range
pl: free: wykryto niedomiar; mh_nbytes poza zakresem

source: free: start and end chunk sizes differ
pl: free: rozmiar pocz±tkowy i koñcowy fragmentu s± ró¿ne

source: realloc: called with unallocated block argument
pl: realloc: wywo³ane dla bloku, który nie zosta³ przydzielony

source: realloc: underflow detected; mh_nbytes out of range
pl: realloc: wykryto niedomiar; mh_nbytes poza zakresem

source: realloc: start and end chunk sizes differ
pl: realloc: rozmiar pocz±tkowy i koñcowy fragmentu s± ró¿ne

source: register_alloc: alloc table is full with FIND_ALLOC?
pl: register_alloc: tablica alokacji jest pe³na podczas FIND_ALLOC?

source: register_alloc: %p already in table as allocated?
pl: register_alloc: %p ju¿ znajduje siê w tablicy jako przydzielony?

source: register_free: %p already in table as free?
pl: register_free: %p ju¿ znajduje siê w tablicy jako wolny?

source: invalid base
pl: nieprawid³owa podstawa

source: %s: host unknown
pl: %s: nieznany host

source: %s: invalid service
pl: %s: nieznana us³uga

source: %s: bad network path specification
pl: %s: ¼le okre¶lona ¶cie¿ka sieciowa

source: network operations not supported
pl: operacje sieciowe nie s± wspierane

source: setlocale: LC_ALL: cannot change locale (%s)
pl: setlocale: LC_ALL: nie mo¿na zmieniæ lokalizacji (%s)

source: setlocale: LC_ALL: cannot change locale (%s): %s
pl: setlocale: LC_ALL: nie mo¿na zmieniæ lokalizacji (%s): %s

source: setlocale: %s: cannot change locale (%s)
pl: setlocale: %s: nie mo¿na zmieniæ lokalizacji (%s)

source: setlocale: %s: cannot change locale (%s): %s
pl: setlocale: %s: nie mo¿na zmieniæ lokalizacji (%s): %s

source: You have mail in $_
pl: Masz pocztê w $_

source: You have new mail in $_
pl: Masz now± pocztê w $_

source: The mail in %s has been read
pl: Poczta w %s jest przeczytana

source: syntax error: arithmetic expression required
pl: b³±d sk³adni: oczekiwano wyra¿enia arytmetycznego

source: syntax error: `;' unexpected
pl: b³±d sk³adni: oczekiwany `;'

source: syntax error: `((%s))'
pl: b³±d sk³adni: `((%s))'

source: make_here_document: bad instruction type %d
pl: make_here_document: z³y rodzaj instrukcji %d

source: here-document at line %d delimited by end-of-file (wanted `%s')
pl: dokument miejscowy w linii %d ograniczony koñcem pliku (oczekiwano `%s')

source: make_redirection: redirection instruction `%d' out of range
pl: make_redirection: instrukcja przekierowania `%d' poza zakresem

source: unexpected EOF while looking for matching `%c'
pl: nieoczekiwany EOF podczas poszukiwania pasuj±cego `%c'

source: unexpected EOF while looking for `]]'
pl: nieoczekiwany EOF podczas poszukiwania `]]'
