Repository: bminor/bash
Catalog: po/*.po
Languages: pl

source: Mark shell variables as unchangeable. Mark each NAME as read-only; the values of these NAMEs may not be changed by subsequent assignment. If VALUE is supplied, assign VALUE before marking as read-only. Options: -a refer to indexed array variables -A refer to associative array variables -f refer to shell functions -p display a list of all readonly variables and functions An argument of `--' disables further option processing. Exit Status: Returns success unless an invalid option is given or NAME is invalid.
pl: Oznaczenie zmiennych pow³oki jako niezmiennych. Oznaczenie ka¿dej NAZWY jako tylko do odczytu; warto¶ci tych NAZW nie mog± byæ zmieniane przez pó¼niejsze podstawienia. Je¶li podano WARTO¦Æ, jest ona przypisywana przed oznaczeniem jako tylko do odczytu. Opcje: -a dzia³anie na zmiennych tablicowych indeksowanych -A dzia³anie na zmiennych tablicowych asocjacyjnych -f dzia³anie na funkcjach pow³oki -p wy¶wietlenie listy wszystkich zmiennych i funkcji tylko do odczytu Argument `--' wy³±cza dalsze przetwarzanie opcji. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano nieprawid³ow± opcjê lub NAZWÊ.

source: Shift positional parameters. Rename the positional parameters $N+1,$N+2 ... to $1,$2 ... If N is not given, it is assumed to be 1. Exit Status: Returns success unless N is negative or greater than $#.
pl: Przesuniêcie argumentów pozycyjnych. Zmiana nazw argumentów pozycyjnych $N+1,$N+2 ... na $1,$2 ... Je¶li nie podano N, przyjmuje siê 1. Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e N jest ujemne lub wiêksze ni¿ $#.

source: Execute commands from a file in the current shell. Read and execute commands from FILENAME in the current shell. The entries in $PATH are used to find the directory containing FILENAME. If any ARGUMENTS are supplied, they become the positional parameters when FILENAME is executed. Exit Status: Returns the status of the last command executed in FILENAME; fails if FILENAME cannot be read.
pl: Wykonanie poleceñ z pliku w bie¿±cej pow³oce. Odczytanie i uruchomienie poleceñ z PLIKU w bie¿±cej pow³oce. Do znalezienia katalogu zawieraj±cego PLIK u¿ywane s± ¶cie¿ki zawarte w $PATH. Je¶li podane zostan± jakiekolwiek ARGUMENTY, staj± siê parametrami pozycyjnymi podczas uruchomienia PLIKU. Stan wyj¶ciowy: Zwracany jest stan ostatnio wykonanego polecenia z PLIKU lub b³±d, je¶li PLIKU nie uda³o siê odczytaæ.

source: Suspend shell execution. Suspend the execution of this shell until it receives a SIGCONT signal. Unless forced, login shells cannot be suspended. Options: -f force the suspend, even if the shell is a login shell Exit Status: Returns success unless job control is not enabled or an error occurs.
pl: Wstrzymanie wykonywania pow³oki. Wstrzymanie wykonywania danego skryptu do czasu otrzymania sygna³u SIGCONT. Je¶li nie podano opcji wymuszenia, pow³oki logowania nie mo¿na wstrzymaæ. Opcje: -f wymuszenie wstrzymania, nawet je¶li pow³oka jest pow³ok± logowania Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e kontrola zadañ jest wy³±czona lub wyst±pi b³±d.

source: Evaluate conditional expression. This is a synonym for the "test" builtin, but the last argument must be a literal `]', to match the opening `['.
pl: Obliczenie wyra¿enia warunkowego. Jest to synonim dla wbudowanego polecenia "test", ale wymagaj±cy, by ostatnim argumentem by³ `]' pasuj±cy do pocz±tkowego `['.

source: Display process times. Prints the accumulated user and system times for the shell and all of its child processes. Exit Status: Always succeeds.
pl: Wy¶wietlenie czasów procesu. Wypisanie ³±cznych czasów w przestrzeni u¿ytkownika i systemu dla pow³oki i wszystkich procesów potomnych. Stan wyj¶ciowy: Zawsze prawda.

source: Trap signals and other events. Defines and activates handlers to be run when the shell receives signals or other conditions. ARG is a command to be read and executed when the shell receives the signal(s) SIGNAL_SPEC. If ARG is absent (and a single SIGNAL_SPEC is supplied) or `-', each specified signal is reset to its original value. If ARG is the null string each SIGNAL_SPEC is ignored by the shell and by the commands it invokes. If a SIGNAL_SPEC is EXIT (0) ARG is executed on exit from the shell. If a SIGNAL_SPEC is DEBUG, ARG is executed before every simple command. If a SIGNAL_SPEC is RETURN, ARG is executed each time a shell function or a script run by the . or source builtins finishes executing. A SIGNAL_SPEC of ERR means to execute ARG each time a command's failure would cause the shell to exit when the -e option is enabled. If no arguments are supplied, trap prints the list of commands associated with each signal. Options: -l print a list of signal names and their corresponding numbers -p display the trap commands associated with each SIGNAL_SPEC Each SIGNAL_SPEC is either a signal name in <signal.h> or a signal number. Signal names are case insensitive and the SIG prefix is optional. A signal may be sent to the shell with "kill -signal $$". Exit Status: Returns success unless a SIGSPEC is invalid or an invalid option is given.
pl: Przechwytywanie sygna³ów i innych zdarzeñ. Polecenie definiuj±ce i w³±czaj±ce dan± akcjê w przypadku, kiedy pow³oka otrzyma sygna³ lub pod innymi warunkami. Gdy pow³oka otrzyma podany SYGNA£ (lub sygna³y), odczytywane i uruchamiane jest polecenie podane jako argument ARG. W razie braku argumentu (i podaniu pojedynczego SYGNA£U) lub gdy argumentem jest `-', ka¿demu z podanych sygna³ów jest przywracane pierwotne zachowanie. Je¶li ARG jest pustym ³añcuchem, ka¿dy SYGNA£ jest ignorowany przez pow³okê i wywo³ane przez ni± polecenia. Je¿eli jako SYGNA£ podano EXIT (0), polecenie ARG jest uruchamiane przy opuszczaniu pow³oki. Je¶li jako SYGNA£ podano DEBUG, ARG jest uruchamiane po ka¿dym poleceniu prostym. Je¶li jako SYGNA£ podano RETURN, ARG jest uruchamiane przy ka¿dym zakoñczeniu funkcji pow³oki lub skryptu uruchamianego przez polecenia wbudowane . lub source. Je¶li jako SYGNA£ podano ERR, ARG jest uruchamiane za ka¿dym razem, kiedy niepowodzenie polecenia spowodowa³oby zakoñczenie pow³oki w przypadku w³±czenia opcji -e. Je¶li nie podano argumentów, trap wypisuje listê poleceñ przypisanych do ka¿dego sygna³u. Opcje: -l wypisanie listy nazw sygna³ów i ich numerów -p wypisanie poleceñ trap powi±zanych z ka¿dym SYGNA£EM Ka¿dy podawany SYGNA£ mo¿e byæ nazw± sygna³u wg. <signal.h> lub numerem sygna³u. Nazwy sygna³ów s± niewra¿liwe na wielko¶æ liter, a prefiks SIG jest opcjonalny. Sygna³ do pow³oki mo¿na wys³aæ poleceniem "kill -sygna³ $$". Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdny SYGNA£ lub b³êdn± opcjê.

source: Display information about command type. For each NAME, indicate how it would be interpreted if used as a command name. Options: -a display all locations containing an executable named NAME; includes aliases, builtins, and functions, if and only if the `-p' option is not also used -f suppress shell function lookup -P force a PATH search for each NAME, even if it is an alias, builtin, or function, and returns the name of the disk file that would be executed -p returns either the name of the disk file that would be executed, or nothing if `type -t NAME' would not return `file'. -t output a single word which is one of `alias', `keyword', `function', `builtin', `file' or `', if NAME is an alias, shell reserved word, shell function, shell builtin, disk file, or not found, respectively Arguments: NAME Command name to be interpreted. Exit Status: Returns success if all of the NAMEs are found; fails if any are not found.
pl: Wy¶wietlenie informacji o rodzaju polecenia. Okre¶lenie, w jaki sposób by³aby interpretowana ka¿da NAZWA w przypadku u¿ycia jako polecenie. Opcje: -a wy¶wietlenie wszystkich po³o¿eñ zawieraj±cych program wykonywalny o podanej NAZWIE; obejmuje aliasy, polecenia wbudowane i funkcje tylko je¶li nie podano dodatkowo opcji `-p' -f pominiêcie wyszukiwania funkcji pow³oki -P wymuszenie wyszukiwania w PATH ka¿dej nazwy, nawet je¶li jest aliasem, poleceniem wbudowanym lub funkcj± i zwrócenie nazwy pliku na dysku -p zwrócenie nazwy pliku na dysku lub niczego, je¶li `type -t NAZWA' nie zwróci³oby `file'. -t zwrócenie pojedynczego s³owa: `alias', `keyword', `function', `builtin', `file' lub `', je¶li nazwa jest odpowiednio: aliasem, zarezerwowanym s³owem kluczowym pow³oki, funkcj± pow³oki, poleceniem wbudowanym pow³oki, plikiem na dysku lub nie zostanie znaleziona Argumenty: NAZWA Nazwa polecenia do zinterpretowania. Stan wyj¶ciowy: Zwracana jest prawda, je¶li ka¿da NAZWA zostanie znaleziona; fa³sz, je¶li którakolwiek nie zostanie znaleziona.

source: Display or set file mode mask. Sets the user file-creation mask to MODE. If MODE is omitted, prints the current value of the mask. If MODE begins with a digit, it is interpreted as an octal number; otherwise it is a symbolic mode string like that accepted by chmod(1). Options: -p if MODE is omitted, output in a form that may be reused as input -S makes the output symbolic; otherwise an octal number is output Exit Status: Returns success unless MODE is invalid or an invalid option is given.
pl: Wy¶wietlanie i ustawianie maski uprawnieñ plików. Ustawienie maski uprawnieñ tworzonych plików na UPRAWNIENIA. Je¶li pominiêto UPRAWNIENIA, wypisywana jest aktualna warto¶æ maski. Je¶li UPRAWNIENIA zaczynaj± siê od cyfry, s± interpretowane jako liczba ósemkowa; w przeciwnym wypadku jako ³añcuch symbolicznych uprawnieñ, jak w poleceniu chmod(1). Opcje: -p je¶li pominiêto UPRAWNIENIA, wypisywanie w formie nadaj±cej siê do ponownego u¿ycia jako wej¶cie -S wyj¶cie w postaci symbolicznej; bez tej opcji jest ósemkowe Stan wyj¶ciowy: Zwracana jest prawda, chyba ¿e podano b³êdne uprawnienia lub b³êdn± opcjê.

source: Execute commands for each member in a list. The `for' loop executes a sequence of commands for each member in a list of items. If `in WORDS ...;' is not present, then `in "$@"' is assumed. For each element in WORDS, NAME is set to that element, and the COMMANDS are executed. Exit Status: Returns the status of the last command executed.
pl: Wykonanie poleceñ dla ka¿dego elementu z listy. Pêtla `for' uruchamia ci±g poleceñ dla ka¿dego elementu podanej listy. Gdy nie zostanie podane `in S£OWA ...;', zak³ada siê, ¿e podano `in "$@"'. Dla ka¿dego elementu S£ÓW, NAZWA jest ustawiana na ten element i uruchamiane s± POLECENIA. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Arithmetic for loop. Equivalent to (( EXP1 )) while (( EXP2 )); do COMMANDS (( EXP3 )) done EXP1, EXP2, and EXP3 are arithmetic expressions. If any expression is omitted, it behaves as if it evaluates to 1. Exit Status: Returns the status of the last command executed.
pl: Arytmetyczna pêtla for. Równowa¿ne (( WYR1 )) while (( WYR2 )); do POLECENIA (( WYR3 )) done WYR1, WYR2 i WYR3 s± wyra¿eniami arytmetycznymi. Je¶li które¶ z wyra¿eñ zostanie pominiête, zachowanie jest takie, jakby mia³o ono warto¶æ 1. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Select words from a list and execute commands. The WORDS are expanded, generating a list of words. The set of expanded words is printed on the standard error, each preceded by a number. If `in WORDS' is not present, `in "$@"' is assumed. The PS3 prompt is then displayed and a line read from the standard input. If the line consists of the number corresponding to one of the displayed words, then NAME is set to that word. If the line is empty, WORDS and the prompt are redisplayed. If EOF is read, the command completes. Any other value read causes NAME to be set to null. The line read is saved in the variable REPLY. COMMANDS are executed after each selection until a break command is executed. Exit Status: Returns the status of the last command executed.
pl: Wybór s³ów z listy i wykonanie poleceñ. S£OWA s± rozwijane, co tworzy listê s³ów. Zbiór rozwiniêtych s³ów wypisywany jest na standardowym wyj¶ciu diagnostycznym, a ka¿de s³owo jest poprzedzone przez liczbê. Gdy nie zostanie podane `in S£OWA', zak³ada siê, ¿e podano `in "$@"'. Wy¶wietlany jest wówczas tekst zachêty PS3 i odczytywany jest wiersz ze standardowego wej¶cia. Gdy wiersz ten sk³ada siê z liczby przypisanej do jednego z wypisanych s³ów, to NAZWA jest ustawiana na to s³owo. Gdy wiersz jest pusty, S£OWA i tekst zachêty s± wy¶wietlane ponownie. Gdy odczytany zostanie EOF, polecenie siê koñczy. Ka¿da inna warto¶æ powoduje przypisanie NAZWIE warto¶ci pustej. Odczytany wiersz jest zachowywany w zmiennej REPLY. Po ka¿dym wyborze uruchamiane s± POLECENIA a¿ do polecenia break. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Report time consumed by pipeline's execution. Execute PIPELINE and print a summary of the real time, user CPU time, and system CPU time spent executing PIPELINE when it terminates. Options: -p print the timing summary in the portable Posix format The value of the TIMEFORMAT variable is used as the output format. Exit Status: The return status is the return status of PIPELINE.
pl: Zg³oszenie czasu zajêtego przez wykonanie potoku poleceñ. Uruchomienie POTOKU poleceñ i wypisanie podsumowania zawieraj±cego czas rzeczywisty, czas procesora w trybie u¿ytkownika oraz czas procesora w trybie systemu, jakie spêdzi³ POTOK poleceñ do chwili zakoñczenia. Opcje: -p wypisanie podsumowania czasów w przeno¶nym formacie POSIX Jako format danych wyj¶ciowych u¿ywana jest warto¶æ zmiennej TIMEFORMAT. Stan wyj¶ciowy: Polecenie zwraca status zakoñczenia POTOKU poleceñ.

source: Execute commands based on pattern matching. Selectively execute COMMANDS based upon WORD matching PATTERN. The `|' is used to separate multiple patterns. Exit Status: Returns the status of the last command executed.
pl: Wykonanie poleceñ w oparciu o dopasowanie do wzorców. Wybiórcze uruchamianie POLECEÑ w zale¿no¶ci od tego, czy S£OWO pasuje do WZORCA. Znak `|' s³u¿y do rozdzielania wielu wzorców. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Execute commands based on conditional. The `if COMMANDS' list is executed. If its exit status is zero, then the `then COMMANDS' list is executed. Otherwise, each `elif COMMANDS' list is executed in turn, and if its exit status is zero, the corresponding `then COMMANDS' list is executed and the if command completes. Otherwise, the `else COMMANDS' list is executed, if present. The exit status of the entire construct is the exit status of the last command executed, or zero if no condition tested true. Exit Status: Returns the status of the last command executed.
pl: Wykonanie poleceñ w zale¿no¶ci od spe³nienia warunku. Uruchamiana jest lista `if POLECENIA'. Gdy jej kod powrotu jest zerem, uruchamiana jest lista `then POLECENIA'. W przeciwnym przypadku uruchamiane s± poszczególne listy `elif POLECENIA' i, je¶li kod powrotu takiej listy jest zerem, uruchamiana jest odpowiednia lista `then POLECENIA', po czym polecenie if siê koñczy. W przeciwnym przypadku uruchamiana jest lista `else POLECENIA', je¶li taka istnieje. Kodem zakoñczenia ca³ej konstrukcji jest kod zakoñczenia ostatniego uruchomionego polecenia lub zero, gdy ¿aden ze sprawdzanych warunków nie by³ prawdziwy. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Execute commands as long as a test succeeds. Expand and execute COMMANDS as long as the final command in the `while' COMMANDS has an exit status of zero. Exit Status: Returns the status of the last command executed.
pl: Wykonywanie poleceñ dopóki test koñczy siê powodzeniem. Rozwijanie i uruchamianie POLECEÑ dopóki ostatnie polecenie w POLECENIACH `while' koñczy siê z kodem zero. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Execute commands as long as a test does not succeed. Expand and execute COMMANDS as long as the final command in the `until' COMMANDS has an exit status which is not zero. Exit Status: Returns the status of the last command executed.
pl: Wykonywanie poleceñ dopóki test nie koñczy siê powodzeniem. Rozwijanie i uruchamianie POLECEÑ dopóki ostatnie polecenie w POLECENIACH `until' koñczy siê z kodem niezerowym. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Create a coprocess named NAME. Execute COMMAND asynchronously, with the standard output and standard input of the command connected via a pipe to file descriptors assigned to indices 0 and 1 of an array variable NAME in the executing shell. The default NAME is "COPROC". Exit Status: Returns the exit status of COMMAND.
pl: Utworzenie koprocesu o podanej NAZWIE. Asynchroniczne wykonanie POLECENIA ze standardowym wyj¶ciem i standardowym wej¶ciem polecenia po³±czonych potokiem z deskryptorami plików przypisanymi do indeksów 0 i 1 zmiennej tablicowej NAZWA w pow³oce. Domy¶ln± NAZW¡ jest "COPROC". Stan wyj¶ciowy: Zwracany jest status zakoñczenia POLECENIA.

source: Define shell function. Create a shell function named NAME. When invoked as a simple command, NAME runs COMMANDs in the calling shell's context. When NAME is invoked, the arguments are passed to the function as $1...$n, and the function's name is in $FUNCNAME. Exit Status: Returns success unless NAME is readonly.
pl: Zdefiniowanie funkcji pow³oki. Utworzenie funkcji pow³oki o podanej NAZWIE. Przy wywo³aniu jako zwyk³ego polecenia NAZWA uruchamia POLECENIA w kontek¶cie pow³oki wywo³uj±cej. Przy wywo³ywaniu NAZWY, argumenty s± przekazywane do funkcji jako $1...$n, a nazwa funkcji w $FUNCNAME. Stan wyj¶ciowy: Zwracany jest sukces, chyba ¿e NAZWA jest tylko do odczytu.

source: Group commands as a unit. Run a set of commands in a group. This is one way to redirect an entire set of commands. Exit Status: Returns the status of the last command executed.
pl: Grupowanie poleceñ jako jednostki. Uruchomienie zbioru poleceñ jako grupy. W ten sposób mo¿na przekierowaæ ca³y zbiór poleceñ. Stan wyj¶ciowy: Zwracany jest status zakoñczenia ostatniego wykonanego polecenia.

source: Resume job in foreground. Equivalent to the JOB_SPEC argument to the `fg' command. Resume a stopped or background job. JOB_SPEC can specify either a job name or a job number. Following JOB_SPEC with a `&' places the job in the background, as if the job specification had been supplied as an argument to `bg'. Exit Status: Returns the status of the resumed job.
pl: Wznowienie zadania jako pierwszoplanowego. Równowa¿ne argumentowi ZADANIE polecenia `fg'. Wznowienie zatrzymanego lub dzia³aj±cego w tle zadania. ZADANIE mo¿e okre¶laæ nazwê zadania albo jego numer. Umieszczenie `&' po ZADANIU umieszcza zadanie w tle tak, jak to siê dzieje po podaniu specyfikacji zadania jako argumentu dla `bg'. Stan wyj¶ciowy: Zwracany jest stan wznowionego zadania.

source: Evaluate arithmetic expression. The EXPRESSION is evaluated according to the rules for arithmetic evaluation. Equivalent to "let EXPRESSION". Exit Status: Returns 1 if EXPRESSION evaluates to 0; returns 0 otherwise.
pl: Obliczenie wyra¿enia arytmetycznego. Obliczenie WYRA¯ENIA zgodnie z zasadami obliczania wyra¿eñ arytmetycznych. Równowa¿ne "let WYRA¯ENIE". Stan wyj¶ciowy: Zwracane jest 1, je¶li warto¶ci± WYRA¯ENIA jest 0; 0 w przeciwnym wypadku.

source: Execute conditional command. Returns a status of 0 or 1 depending on the evaluation of the conditional expression EXPRESSION. Expressions are composed of the same primaries used by the `test' builtin, and may be combined using the following operators: ( EXPRESSION ) Returns the value of EXPRESSION ! EXPRESSION True if EXPRESSION is false; else false EXPR1 && EXPR2 True if both EXPR1 and EXPR2 are true; else false EXPR1 || EXPR2 True if either EXPR1 or EXPR2 is true; else false When the `==' and `!=' operators are used, the string to the right of the operator is used as a pattern and pattern matching is performed. When the `=~' operator is used, the string to the right of the operator is matched as a regular expression. The && and || operators do not evaluate EXPR2 if EXPR1 is sufficient to determine the expression's value. Exit Status: 0 or 1 depending on value of EXPRESSION.
pl: Wykonanie polecenia warunkowego. Zwracany jest status wynosz±cy 0 lub 1 w zale¿no¶ci od wyniku WYRA¯ENIA warunkowego. Wyra¿enia s± tworzone na tych samych zasadach, co w poleceniu `test' i mog± byæ ³±czone za pomoc± nastêpuj±cych operatorów: ( WYRA¯ENIE ) zwraca warto¶æ WYRA¯ENIA ! WYRA¯ENIE prawdziwe, gdy WYRA¯ENIE jest fa³szywe; fa³szywe w innym przypadku WYR1 && WYR2 Prawdziwe, gdy zarówno WYR1 jak i WYR2 s± prawdziwe; fa³szywe w innym przypadku WYR1 || WYR2 Prawdziwe, gdy WYR1 lub WYR2 jest prawdziwe; fa³szywe w innym przypadku W przypadku u¿ycia operatorów `==' lub `!=' napis po prawej stronie operatora jest traktowany jak wzorzec i wykonywane jest dopasowywanie do wzorca. W przypadku u¿ycia operatora `=~' ³añcuch po prawej stronie operatora jest dopasowywany jako wyra¿enie regularne. Operatory && i || nie obliczaj± WYR2, je¶li obliczenie WYR1 wystarcza do okre¶lenia warto¶ci wyra¿enia. Stan wyj¶ciowy: 0 lub 1 w zale¿no¶ci od warto¶ci WYRA¯ENIA.
